[
    {
        "region": "Alberta (Canada)",
        "issues": [
            {
                "issue": "Permitting and authorisation",
                "regulation": "Carbon Sequestration Tenure Regulation",
                "text": "The Carbon Sequestration Tenure Regulation establishes the permitting framework for evaluating and approving CO2 sequestration projects in Alberta.\n\n**Section 3: Evaluation Permit**\n1. A person may apply to the Minister for an agreement under Section 115 of the Mines and Minerals Act.\n2. The Minister may issue an evaluation permit if the applicant provides:\n   - A completed application in an approved form.\n   - The application fee prescribed under the Mines and Minerals Administration Regulation.\n   - The first-year annual rental payment as prescribed under Section 6.\n   - A monitoring, measurement, and verification plan that meets Section 7 requirements.\n3. An evaluation permit grants the right to conduct evaluations and testing, including:\n   - Drilling wells and injecting substances (as approved by the Regulator) into deep subsurface reservoirs.\n   - Assessing geological and geophysical properties to determine suitability for CO2 sequestration.\n4. The Minister may impose limitations on the permitted operations.\n5. An evaluation permit does not grant rights to extract or recover any minerals found within the permit area.\n\n**Regulatory Framework: Mines and Minerals Act**\n- The Act grants the Alberta government the authority to manage and allocate mineral rights.\n- It applies to all Crown-owned natural resources, including wells, mines, quarries, and minerals.\n- The Act outlines how mineral agreements are established, renewed, or canceled.\n- Administration is divided between Alberta Energy and Alberta Environment and Parks, depending on the resource type.\n\n**Carbon Capture and Storage Statutes Amendment Act (2010)**\nAmendments to the Mines and Minerals Act in 2010 introduced provisions to:\n1. Declare that all pore space in Alberta is owned by the province.\n2. Enable the Minister to grant agreements for CO2 injection into pore space for storage.\n3. Establish the province’s assumption of certain obligations upon issuance of a closure certificate.\n4. Create a Post-Closure Stewardship Fund, funded by lessee fees, to cover long-term post-closure costs.\n\nThe regulatory framework ensures Alberta’s CO2 sequestration activities are permitted, monitored, and managed within a structured legal and environmental oversight system.",
                "year": 2000,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Submit a completed application with the required fee, first-year rental payment, and a compliant monitoring plan to obtain an evaluation permit for CO2 sequestration projects.",
                "summary": "- Apply for an evaluation permit through the Minister under Section 115 of the Mines and Minerals Act.\n- Ensure your application is complete, using the approved form, and include the application fee as per the Mines and Minerals Administration Regulation.\n- Pay the first-year annual rental fee as specified in Section 6.\n- Submit a monitoring, measurement, and verification plan that complies with Section 7 requirements.\n- Use the evaluation permit to conduct evaluations and testing, such as drilling wells and injecting approved substances into deep subsurface reservoirs.\n- Assess geological and geophysical properties to determine the site's suitability for CO2 sequestration.\n- Be aware that the Minister may impose limitations on your operations.\n- Understand that an evaluation permit does not allow for the extraction or recovery of minerals within the permit area.\n- Recognize that the Mines and Minerals Act gives Alberta the authority to manage mineral rights, including the establishment, renewal, or cancellation of mineral agreements.\n- Note that the 2010 amendments to the Mines and Minerals Act declare all pore space in Alberta as provincial property and allow the Minister to grant CO2 injection agreements.\n- Be informed that the province assumes certain obligations upon issuing a closure certificate and has established a Post-Closure Stewardship Fund for long-term post-closure costs.",
                "link": ""
            },
            {
                "issue": "Financial assurances of long-term site stewardship",
                "regulation": "Mines and Minerals Act",
                "text": "Section 122: Post-Closure Stewardship Fund\n\n(1) The Post-closure Stewardship Fund is established.\n\n(2) The Fund may be used\n(a) for the purposes of monitoring the behaviour of captured carbon dioxide that has been injected pursuant to an agreement under this Part;\n(b) for the purposes of fulfilling any obligations that are assumed by the Crown pursuant to section 121(1)(b);\n(c) for the purposes of paying for suspension costs, abandonment costs and related reclamation or remediation costs in respect of orphan facilities where the work is carried out\n(i) by the Regulator,\n(ii) by a person authorized by the Regulator, or\n(iii) by a Director or a person authorized by a Director in accordance with the Environmental Protection and Enhancement Act;\n(d) for the purposes of paying for costs incurred in pursuing reimbursement for the costs referred to in clause (c) from the lessee responsible for paying them;\n(e) for any other purpose prescribed in the regulations.\n\n(3) Fees must be paid by a lessee into the Fund in accordance with the regulations.\n\n(4) The Fund is to be held and administered by the Minister in accordance with this Act and the regulations.\n\n(5) The Minister may be a participant under section 40 of the Financial Administration Act with respect to the Fund.\n\n(6) The Minister may make payments out of the Fund for the purposes of the Fund.\n\n(7) Income earned by the Fund accrues to and becomes part of the Fund.\n\n(8) The Minister must maintain a separate accounting record of the Fund.\n\nMines and Minerals Act\n\nThe Act provides the Government of Alberta with authority to administer, allocate, and enter into agreements with respect to minerals. It applies to all mines and minerals and related natural resources belonging to the Crown including wells, mines, quarries and minerals. The Act defines mines and minerals, and sets out how agreements in respect to minerals are established, renewed or cancelled. The Act is administered by Energy except for Part 8, which is administered by Environment and Parks along with the related Exploration Regulation and the Metallic and Industrial Minerals Exploration Regulation. All exploration for oil and gas, and metallic or industrial minerals requires approval by Environment and Parks.\n\nThe Carbon Capture and Storage Statutes Amendment Act, S.A. 2010, c. 14, amended the Act in December 2010, along with a number of other acts, to insert provisions:\n1. declaring that all pore space in Alberta is owned by the province;\n2. enabling the Minister to enter into an agreement granting the right to inject CO2 into pore space within Alberta for storage purposes;\n3. enabling assumption by the province of certain obligations on issuance of a closure certificate; and\n4. creating a Post-Closure Stewardship Fund drawn from fees paid by lessees, to cover certain post-closure costs.",
                "year": 2000,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Pay the required fees into the Post-Closure Stewardship Fund as a lessee in accordance with the regulations.",
                "summary": "- Establish the Post-Closure Stewardship Fund for monitoring and managing long-term site stewardship.\n- Use the Fund for monitoring injected CO2 behavior, fulfilling Crown obligations, and covering costs related to orphan facilities.\n- Ensure lessees pay fees into the Fund as per regulations.\n- Administer the Fund under the Minister's authority, maintaining separate accounting records.\n- Recognize the province's ownership of all pore space in Alberta.\n- Allow the Minister to grant rights for CO2 injection into pore space for storage.\n- Understand the province's assumption of obligations upon closure certificate issuance.\n- Note that the Fund's income becomes part of the Fund, supporting its sustainability.",
                "link": ""
            },
            {
                "issue": "Measurement, monitoring and verification plans",
                "regulation": "Carbon Sequestration Tenure Regulation",
                "text": "Section 16: Duration and renewal of plan\n\n(1) A monitoring, measurement and verification plan that is approved by the Minister in relation to a carbon sequestration lease ceases to have effect on the earlier of\n(a) the third anniversary of the date on which the plan was approved, and\n(b) the date that the lease is renewed.\n\n(2) A lessee must submit a new monitoring, measurement and verification plan for approval under section 15 no fewer than  before the date on which the approved plan ceases to have effect.\n\nSection 17: Compliance with plan\n\n(1) A lessee must not conduct any operations or activities under a carbon sequestration lease unless\n(a) a monitoring, measurement and verification plan has been approved and is in effect for the lease, and\n(b) the lessee complies with the approved plan.\n\n(2) Each year, before the anniversary date of the monitoring, measurement and verification plan that is in effect for the carbon sequestration lease, the lessee must submit to the Minister a report that sets out the findings and observations from the monitoring, measurement and verification activities that the lessee has conducted.\n\nMines and Minerals Act\n\nThe Act provides the Government of Alberta with authority to administer, allocate, and enter into agreements with respect to minerals. It applies to all mines and minerals and related natural resources belonging to the Crown including wells, mines, quarries and minerals. The Act defines mines and minerals, and sets out how agreements in respect to minerals are established, renewed or cancelled. The Act is administered by Energy except for Part 8, which is administered by Environment and Parks along with the related Exploration Regulation and the Metallic and Industrial Minerals Exploration Regulation. All exploration for oil and gas, and metallic or industrial minerals requires approval by Environment and Parks.\n\nThe Carbon Capture and Storage Statutes Amendment Act, S.A. 2010, c. 14, amended the Act in December 2010, along with a number of other acts, to insert provisions:\n1. declaring that all pore space in Alberta is owned by the province;\n2. enabling the Minister to enter into an agreement granting the right to inject CO2 into pore space within Alberta for storage purposes;\n3. enabling assumption by the province of certain obligations on issuance of a closure certificate; and\n4. creating a Post-Closure Stewardship Fund drawn from fees paid by lessees, to cover certain post-closure costs.",
                "year": 2000,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Submit a new monitoring, measurement, and verification plan for approval at least 90 days before the current plan expires and annually report findings to the Minister.",
                "summary": "- Ensure monitoring, measurement, and verification plans are approved by the Minister and are valid for a maximum of three years or until lease renewal.\n- Submit a new plan for approval before the current plan expires to maintain compliance.\n- Conduct operations only if an approved plan is in effect and strictly adhere to it.\n- Annually report findings and observations from monitoring activities to the Minister before the plan's anniversary date.\n- Recognize Alberta's ownership of all pore space for CO2 storage and the Minister's authority to grant injection rights.\n- Understand the province's assumption of certain obligations upon closure certificate issuance.\n- Contribute to the Post-Closure Stewardship Fund for covering post-closure costs.",
                "link": ""
            }
        ]
    },
    {
        "region": "British Columbia (Canada)",
        "issues": [
            {
                "issue": "Permitting and authorisation",
                "regulation": "Petroleum and Natural Gas Act",
                "text": "The Petroleum and Natural Gas Act establishes the permitting framework for CO2 storage and drilling operations in British Columbia, regulated by the BC Oil and Gas Commission.\n\n**Section 130: Lease of Storage Reservoir**\n1. The holder of a petroleum or natural gas permit, drilling license, or lease, or an exploration license granted under Section 126, may apply to the minister for a lease of a government-owned storage reservoir.\n2. The lease grants rights to use the storage reservoir for gas storage, including CO2, subject to regulatory approval.\n\n**Regulatory Oversight**\n- The Act outlines the administrative process for obtaining drilling and well permits in British Columbia.\n- It provides a legal framework for managing petroleum and natural gas resources, including CO2 storage operations.\n- The BC Oil and Gas Commission oversees the permitting process and regulatory compliance.\n\nThe Act ensures that CO2 storage and petroleum resource management in British Columbia follow structured permitting and leasing processes while maintaining regulatory oversight.",
                "year": 1996,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Apply to the minister for a lease of a government-owned storage reservoir for CO2 storage, ensuring compliance with the BC Oil and Gas Commission's regulatory approval process.",
                "summary": "- Ensure familiarity with the Petroleum and Natural Gas Act as it establishes the permitting framework for CO2 storage and drilling operations in British Columbia.\n- Understand that the BC Oil and Gas Commission regulates these operations, ensuring compliance with the Act.\n- Recognize that Section 130 allows holders of specific permits or licenses to apply for a lease of a government-owned storage reservoir for gas storage, including CO2, subject to regulatory approval.\n- Follow the administrative process outlined in the Act for obtaining drilling and well permits in British Columbia.\n- Acknowledge that the Act provides a legal framework for managing petroleum and natural gas resources, including CO2 storage operations.\n- Ensure all CO2 storage and petroleum resource management activities adhere to the structured permitting and leasing processes mandated by the Act.",
                "link": ""
            }
        ]
    },
    {
        "region": "European Union",
        "issues": [
            {
                "issue": "Permitting and authorisation",
                "regulation": "CCS Directive (Article 7)",
                "text": "Applications for storage permits must include the following information:\n\n1. Name and address of the potential operator.\n2. Proof of the technical competence of the potential operator.\n3. Characterization of the storage site and complex, including an assessment of expected storage security under Article 4(3) and (4).\n4. Total quantity of CO2 to be injected and stored, including sources, transport methods, CO2 composition, injection rates, pressures, and injection facility locations.\n5. Description of measures to prevent significant irregularities.\n6. Proposed monitoring plan pursuant to Article 13(2).\n7. Proposed corrective measures plan pursuant to Article 16(2).\n8. Proposed provisional post-closure plan pursuant to Article 17(3).\n9. Environmental impact information as required under Article 5 of Directive 85/337/EEC.\n10. Proof of financial security or equivalent provision under Article 19, valid before injection begins.\n\nThe EU CO2 Storage Directive provides a legal framework for the environmentally safe geological storage of CO2 to contribute to climate change mitigation. It regulates CO2 storage in geological formations across the EU, covering the entire lifetime of storage sites. It also includes provisions on CO2 capture and transport, which are primarily governed by existing EU environmental laws, such as the Environmental Impact Assessment (EIA) Directive and the Industrial Emissions Directive, as amended by the CCS Directive.",
                "year": 2009,
                "jurisdiction": "Regional",
                "status": "In force",
                "action_point": "Submit a comprehensive storage permit application including operator details, technical competence, site characterization, CO2 specifics, preventive measures, monitoring, corrective and post-closure plans, environmental impact information, and financial security proof.",
                "summary": "- Ensure the application for storage permits includes the name and address of the potential operator.\n- Provide proof of the technical competence of the potential operator.\n- Characterize the storage site and complex, assessing expected storage security as per Article 4(3) and (4).\n- Detail the total quantity of CO2 to be injected and stored, including sources, transport methods, CO2 composition, injection rates, pressures, and injection facility locations.\n- Describe measures to prevent significant irregularities.\n- Propose a monitoring plan in accordance with Article 13(2).\n- Propose corrective measures plan as per Article 16(2).\n- Propose a provisional post-closure plan following Article 17(3).\n- Include environmental impact information as required under Article 5 of Directive 85/337/EEC.\n- Provide proof of financial security or equivalent provision under Article 19, ensuring it is valid before injection begins.\n- Recognize that the EU CO2 Storage Directive offers a legal framework for the environmentally safe geological storage of CO2, contributing to climate change mitigation and covering the entire lifetime of storage sites.\n- Note that CO2 capture and transport are regulated by existing EU environmental laws, such as the EIA Directive and the Industrial Emissions Directive, as amended by the CCS Directive.",
                "link": ""
            },
            {
                "issue": "Financial assurances of long-term site stewardship",
                "regulation": "CCS Directive",
                "text": "Article 20: Financial mechanism\n\n1. Member States shall ensure that the operator, on the basis of arrangements to be decided by the Member States, makes a financial contribution available to the competent authority before the transfer of responsibility pursuant to Article 18 has taken place. The contribution from the operator shall take into account those criteria referred to in Annex I and elements relating to the history of storing CO2 relevant to determining the post-transfer obligations, and cover at least the anticipated cost of monitoring for a period of 30 years. This financial contribution may be used to cover the costs borne by the competent authority after the transfer of responsibility to ensure that the CO2 is completely and permanently contained in geological storage sites after the transfer of responsibility.\n\n2. The Commission may adopt guidelines for the estimation of the costs referred to in paragraph 1 to be developed in consultation with Member States with a view to ensuring transparency and predictability for operators.\n\nEU CO2 Storage Directive\n\nThe directive on the geological storage of CO2 (so-called CCS Directive) establishes a legal framework for the environmentally safe geological storage of CO2 to contribute to the fight against climate change. It covers all CO2 storage in geological formations in the EU and the entire lifetime of storage sites. It also contains provisions on the capture and transport components of CCS, though these activities are covered mainly by existing EU environmental legislation, such as the Environmental Impact Assessment (EIA) Directive or the Industrial Emissions Directive, in conjunction with amendments introduced by the CCS Directive.",
                "year": 2009,
                "jurisdiction": "Regional",
                "status": "In force",
                "action_point": "Ensure the operator provides a financial contribution to the competent authority before the transfer of responsibility, covering at least 30 years of monitoring costs.",
                "summary": "- Ensure operators provide financial contributions to competent authorities before responsibility transfer, as per Article 18.\n- Consider Annex I criteria and CO2 storage history to determine post-transfer obligations and costs.\n- Cover anticipated monitoring costs for a minimum of 30 years post-transfer.\n- Use financial contributions to ensure CO2 remains permanently contained post-transfer.\n- Follow Commission guidelines for cost estimation to maintain transparency and predictability.\n- Recognize that the CCS Directive provides a legal framework for safe CO2 geological storage and addresses capture and transport within existing EU environmental laws.",
                "link": ""
            },
            {
                "issue": "Measurement, monitoring and verification plans",
                "regulation": "CCS Directive",
                "text": "Article 13: Monitoring\n\n1. Member States shall ensure that the operator carries out monitoring of the injection facilities, the storage complex (including where possible the CO2 plume), and where appropriate the surrounding environment for the purpose of:\n(a) comparison between the actual and modelled behaviour of CO2 and formation water, in the storage site;\n(b) detecting significant irregularities;\n(c) detecting migration of CO2;\n(d) detecting leakage of CO2;\n(e) detecting significant adverse effects for the surrounding environment, including in particular on drinking water, for human populations, or for users of the surrounding biosphere;\n(f) assessing the effectiveness of any corrective measures taken pursuant to Article 16;\n(g) updating the assessment of the safety and integrity of the storage complex in the short and long term, including the assessment of whether the stored CO2 will be completely and permanently contained.\n\n2. The monitoring shall be based on a monitoring plan designed by the operator pursuant to the requirements laid down in Annex II, including details on the monitoring in accordance with the guidelines established pursuant to Article 14 and Article 23(2) of Directive 2003/87/EC, submitted to and approved by the competent authority pursuant to Article 7(6) and Article 9(5) of this Directive. The plan shall be updated pursuant to the requirements laid down in Annex II and in any case every five years to take account of changes to the assessed risk of leakage, changes to the assessed risks to the environment and human health, new scientific knowledge, and improvements in best available technology. Updated plans shall be re-submitted for approval to the competent authority.\n\nArticle 14: Reporting by the operator\n\nAt a frequency to be determined by the competent authority, and in any event at least once a year, the operator shall submit to the competent authority:\n1. all results of the monitoring pursuant to Article 13 in the reporting period, including information on the monitoring technology employed;\n2. the quantities and properties of the CO2 streams delivered and injected, including composition of those streams, in the reporting period, registered pursuant to Article 12(3)(b);\n3. proof of the putting in place and maintenance of the financial security pursuant to Article 19 and Article 9(9);\n4. any other information the competent authority considers relevant for the purposes of assessing compliance with storage permit conditions and increasing the knowledge of CO2 behaviour in the storage site.\n\nArticle 17: Closure and post-closure obligations\n\n1. A storage site shall be closed:\n(a) if the relevant conditions stated in the permit have been met;\n(b) at the substantiated request of the operator, after authorisation of the competent authority; or\n(c) if the competent authority so decides after the withdrawal of a storage permit pursuant to Article 11(3).\n\n2. After a storage site has been closed pursuant to points (a) or (b) of paragraph 1, the operator remains responsible for monitoring, reporting and corrective measures, pursuant to the requirements laid down in this Directive […], until the responsibility for the storage site is transferred to the competent authority pursuant to Article 18(1) to (5) of this Directive.\n\n4. After a storage site has been closed pursuant to paragraph 1(c), the competent authority shall be responsible for monitoring and corrective measures pursuant to the requirements laid down in this Directive. The post-closure requirements pursuant to this Directive shall be fulfilled by the competent authority on the basis of the provisional post-closure plan referred to in paragraph 3 of this Article, which shall be updated as necessary.\n\n5. The competent authority shall recover from the operator the costs incurred in relation to the measures referred to in paragraph 4, including by drawing on the financial security pursuant to Article 19.\n\nArticle 18: Transfer of responsibility\n\n1. Where a storage site has been closed pursuant to points (a) or (b) of Article 17(1), all legal obligations relating to monitoring and corrective measures pursuant to the requirements laid down in this Directive, […] shall be transferred to the competent authority on its own initiative or upon request from the operator [subject to certain specified conditions being met].\n\n6. After the transfer of responsibility, […] monitoring may be reduced to a level which allows for detection of leakages or significant irregularities. If any leakages or significant irregularities are detected, monitoring shall be intensified as required to assess the scale of the problem and the effectiveness of corrective measures.\n\nAnnex II: criteria for establishing and updating the monitoring plan referred to in article 13(2) and for post-closure monitoring\n\n1. Establishing and updating the monitoring plan\nThe monitoring plan referred to in Article 13(2) shall be established according to the risk assessment analysis carried out in Step 3 of Annex I, and updated with the purpose of meeting the monitoring requirements laid out in Article 13(1) according to the following criteria:\n1.1. Establishing the plan\nThe monitoring plan shall provide details of the monitoring to be deployed at the main stages of the project, including baseline, operational and post-closure monitoring. The following shall be specified for each phase:\n(a) parameters monitored;\n(b) monitoring technology employed and justification for technology choice;\n(c) monitoring locations and spatial sampling rationale;\n(d) frequency of application and temporal sampling rationale.\nThe parameters to be monitored are identified so as to fulfil the purposes of monitoring. However, the plan shall in any case include continuous or intermittent monitoring of the following items:\n(e) fugitive emissions of CO2 at the injection facility;\n(f) CO2 volumetric flow at injection wellheads;\n(g) CO2 pressure and temperature at injection wellheads (to determine mass flow);\n(h) chemical analysis of the injected material;\n(i) reservoir temperature and pressure (to determine CO2 phase behaviour and state).\n\nThe choice of monitoring technology shall be based on best practice available at the time of design. The following options shall be considered and used as appropriate:\n(j) technologies that can detect the presence, location and migration paths of CO2 in the subsurface and at surface;\n(k) technologies that provide information about pressure-volume behaviour and areal/vertical distribution of CO2-plume to refine numerical 3-D simulation to the 3-D-geological models of the storage formation established pursuant to Article 4 and Annex I;\n(l) technologies that can provide a wide areal spread in order to capture information on any previously undetected potential leakage pathways across the areal dimensions of the complete storage complex and beyond, in the event of significant irregularities or migration of CO2 out of the storage complex.\n\n1.2. Updating the plan\nThe data collected from the monitoring shall be collated and interpreted. The observed results shall be compared with the behaviour predicted in dynamic simulation of the 3-D-pressure-volume and saturation behaviour undertaken in the context of the security characterisation pursuant to Article 4 and Annex I Step 3.\nWhere there is a significant deviation between the observed and the predicted behaviour, the 3-D model shall be recalibrated to reflect the observed behaviour. The recalibration shall be based on the data observations from the monitoring plan, and where necessary to provide confidence in the recalibration assumptions, additional data shall be obtained.\nSteps 2 and 3 of Annex I shall be repeated using the recalibrated 3-D model(s) so as to generate new hazard scenarios and flux rates and to revise and update the risk assessment.\nWhere new CO2 sources, pathways and flux rates or observed significant deviations from previous assessments are identified as a result of history matching and model recalibration, the monitoring plan shall be updated accordingly.\n\n2. Post-closure monitoring\nPost-closure monitoring shall be based on the information collected and modelled during the implementation of the monitoring plan referred to in Article 13(2) and above in point 1.2 of this Annex. It shall serve in particular to provide information required for the determination of Article 18(1).\n\nEU CO2 Storage Directive\n\nThe directive on the geological storage of CO2 (so-called CCS Directive) establishes a legal framework for the environmentally safe geological storage of CO2 to contribute to the fight against climate change. It covers all CO2 storage in geological formations in the EU and the entire lifetime of storage sites. It also contains provisions on the capture and transport components of CCS, though these activities are covered mainly by existing EU environmental legislation, such as the Environmental Impact Assessment (EIA) Directive or the Industrial Emissions Directive, in conjunction with amendments introduced by the CCS Directive.",
                "year": 2009,
                "jurisdiction": "Regional",
                "status": "In force",
                "action_point": "Design, implement, and regularly update a monitoring plan for CO2 storage sites, ensuring compliance with the CCS Directive and obtaining approval from the competent authority.",
                "summary": "- Ensure operators monitor injection facilities, storage complexes, and surrounding environments for CO2 behavior, irregularities, migration, leakage, and environmental impacts as per Article 13.\n- Design monitoring plans based on Annex II criteria, including baseline, operational, and post-closure phases, and update every five years or as needed.\n- Use best available technology for monitoring, considering CO2 detection, pressure-volume behavior, and potential leakage pathways.\n- Require operators to report monitoring results, CO2 stream details, financial security proof, and other relevant information annually to the competent authority as per Article 14.\n- Close storage sites when permit conditions are met, upon operator request, or by competent authority decision as per Article 17.\n- Transfer monitoring and corrective responsibilities to the competent authority post-closure, with cost recovery from the operator as per Articles 17 and 18.\n- Reduce post-transfer monitoring to detect leakages or irregularities, intensifying if issues arise as per Article 18.\n- Update monitoring plans based on new data, recalibrate models for deviations, and revise risk assessments as per Annex II.",
                "link": ""
            },
            {
                "issue": "Operational liabilities and financial security",
                "regulation": "CCS Directive",
                "text": "Preamble. Paragraph 30\n\nProvisions are required concerning liability for damage to the local environment and the climate, resulting from any failure of permanent containment of CO2. Liability for environmental damage (damage to protected species and natural habitats, water and land) is regulated by Directive 2004/35/EC of the European Parliament and of the Council of 21 April 2004 on environmental liability with regard to the prevention and remedying of environmental damage, which should be applied to the operation of storage sites pursuant to this Directive. Liability for climate damage as a result of leakages is covered by the inclusion of storage sites in Directive 2003/87/EC, which requires surrender of emissions trading allowances for any leaked emissions. In addition, this Directive should establish the obligation on the operator of the storage site to take corrective measures in case of leakages or significant irregularities on the basis of a corrective measures plan submitted to and approved by the competent national authority. Where the operator fails to take the necessary corrective measures, these measures should be taken by the competent authority, which should recover the costs from the operator.\n\nParagraph 34\n\nLiabilities other than those covered by this Directive, Directive 2003/87/EC and Directive 2004/35/EC, in particular concerning the injection phase, the closure of the storage site and the period after transfer of legal obligations to the competent authority, should be dealt with at national level.\n\nArticle 17: Closure and post-closure obligations\n\n1. A storage site shall be closed:\n   (a) if the relevant conditions stated in the permit have been met;\n   (b) at the substantiated request of the operator, after authorisation of the competent authority; or\n   (c) if the competent authority so decides after the withdrawal of a storage permit pursuant to Article 11(3).\n\n2. After a storage site has been closed pursuant to points (a) or (b) of paragraph 1, the operator remains responsible for monitoring, reporting and corrective measures, pursuant to the requirements laid down in this Directive, and for all obligations relating to the surrender of allowances in case of leakages pursuant to Directive 2003/87/EC and preventive and remedial actions pursuant to Articles 5 to 8 of Directive 2004/35/EC until the responsibility for the storage site is transferred to the competent authority pursuant to Article 18(1) to (5) of this Directive. The operator shall also be responsible for sealing the storage site and removing the injection facilities.\n\n3. The obligations referred to in paragraph 2 shall be fulfilled on the basis of a post-closure plan designed by the operator based on best practice and in accordance with the requirements laid down in Annex II. A provisional post-closure plan shall be submitted to and approved by the competent authority pursuant to Article 7(8) and Article 9(7). Prior to the closure of a storage site pursuant to points (a) or (b) of paragraph 1 of this Article, the provisional post-closure plan shall be:\n   (a) updated as necessary, taking account of risk analysis, best practice and technological improvements;\n   (b) submitted to the competent authority for its approval; and\n   (c) approved by the competent authority as the definitive post closure plan.\n\n4. After a storage site has been closed pursuant to paragraph 1(c), the competent authority shall be responsible for monitoring and corrective measures pursuant to the requirements laid down in this Directive and for all obligations relating to the surrender of allowances in case of leakages pursuant to Directive 2003/87/EC and preventive and remedial action pursuant to Articles 5(1) and 6(1) of Directive 2004/35/EC. The post-closure requirements pursuant to this Directive shall be fulfilled by the competent authority on the basis of the provisional post-closure plan referred to in paragraph 3 of this Article, which shall be updated as necessary.\n\n5. The competent authority shall recover from the operator the costs incurred in relation to the measures referred to in paragraph 4, including by drawing on the financial security pursuant to Article 19.\n\nEU CO2 Storage Directive\n\nThe directive on the geological storage of CO2 (so-called CCS Directive) establishes a legal framework for the environmentally safe geological storage of CO2 to contribute to the fight against climate change. It covers all CO2 storage in geological formations in the EU and the entire lifetime of storage sites. It also contains provisions on the capture and transport components of CCS, though these activities are covered mainly by existing EU environmental legislation, such as the Environmental Impact Assessment (EIA) Directive or the Industrial Emissions Directive, in conjunction with amendments introduced by the CCS Directive.",
                "year": 2009,
                "jurisdiction": "Regional",
                "status": "In force",
                "link": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32009L0031",
                "action_point": "Submit and obtain approval for a corrective measures plan and a post-closure plan from the competent authority, ensuring compliance with monitoring, reporting, and corrective obligations until responsibility is transferred.",
                "summary": "- Ensure liability for environmental damage is regulated by Directive 2004/35/EC, covering damage to protected species, habitats, water, and land.\n- Address climate damage liability from CO2 leakages through Directive 2003/87/EC, which mandates surrendering emissions trading allowances for leaked emissions.\n- Require operators to take corrective measures for leakages or irregularities, based on an approved corrective measures plan; if operators fail, competent authorities must intervene and recover costs.\n- Manage liabilities not covered by the CCS Directive, Directive 2003/87/EC, and Directive 2004/35/EC, such as during injection, closure, and post-transfer phases, at the national level.\n- Close storage sites when permit conditions are met, upon operator request with authority approval, or if the authority withdraws the permit.\n- Hold operators responsible for monitoring, reporting, corrective measures, and allowance surrender until responsibility transfers to the competent authority.\n- Design post-closure plans based on best practices, update them with risk analysis and technological improvements, and obtain competent authority approval.\n- Assign competent authorities responsibility for monitoring and corrective measures if a site is closed by authority decision, using updated post-closure plans.\n- Recover costs from operators for authority-incurred measures, utilizing financial security as per Article 19."
            },
            {
                "issue": "Storage resource assessment",
                "regulation": "CCS Directive",
                "text": "**Article 4: Selection of storage sites**\n\n1. Member States shall retain the right to determine the areas from which storage sites may be selected pursuant to the requirements of this Directive. This includes the right of Member States not to allow for any storage in parts or in the whole of their territory.\n\n2. Member States which intend to allow geological storage of CO2 in their territory shall undertake an assessment of the storage capacity available in parts or in the whole of their territory, including by allowing exploration pursuant to Article 5. The Commission may organise an exchange of information and best practices between those Member States, in the context of the exchange of information provided for in Article 27.\n\n3. The suitability of a geological formation for use as a storage site shall be determined through a characterisation and assessment of the potential storage complex and surrounding area pursuant to the criteria specified in Annex I.\n\n4. A geological formation shall only be selected as a storage site if, under the proposed conditions of use, there is no significant risk of leakage, and if no significant environmental or health risks exist.\n\n**Annex I: Criteria for the characterisation and assessment of the potential storage complex and surrounding area**\n\nThe characterisation and assessment of the potential storage complex and surrounding area referred to in Article 4(3) shall be carried out in three steps according to best practices at the time of the assessment and the following criteria:\n\n**Step 1: Data collection**\n- Accumulate sufficient data to construct a volumetric and 3D static model of the storage site and surrounding area.\n- Consider geological, geophysical, hydrogeological, geochemical, and geomechanical factors.\n\n**Step 2: Building the three-dimensional static geological earth model**\n- Develop a computer-based model to assess reservoir properties, fracture systems, fluid distributions, and storage capacity.\n\n**Step 3: Characterisation of storage dynamic behaviour, sensitivity characterisation, risk assessment**\n- Use dynamic modelling to simulate CO2 injection, migration, and containment over time.\n- Conduct sensitivity analysis and risk assessment, including hazard characterisation, exposure assessment, and effects assessment.\n\n**EU CO2 Storage Directive**\n\nThe directive on the geological storage of CO2 (so-called \"CCS Directive\") establishes a legal framework for the environmentally safe geological storage of CO2 to contribute to climate change mitigation. It covers all CO2 storage in geological formations in the EU and the entire lifetime of storage sites. It also includes provisions on CO2 capture and transport, which are primarily governed by existing EU environmental laws, such as the Environmental Impact Assessment (EIA) Directive and the Industrial Emissions Directive, as amended by the CCS Directive.",
                "year": 2009,
                "jurisdiction": "Regional",
                "status": "In force",
                "link": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32009L0031",
                "action_point": "Conduct a comprehensive assessment of storage capacity and suitability of geological formations for CO2 storage, ensuring no significant risk of leakage or environmental and health risks, following the criteria in Annex I.",
                "summary": "- Retain the right for Member States to determine storage site areas; they may choose to prohibit storage in parts or all of their territory.\n- Conduct a comprehensive assessment of available storage capacity if geological storage of CO2 is permitted.\n- Facilitate information exchange and best practices among Member States, as organized by the Commission.\n- Ensure geological formations are selected based on characterisation and assessment per Annex I criteria, ensuring no significant leakage, environmental, or health risks.\n- Follow Annex I's three-step process: collect data for a 3D model, build a static geological model, and perform dynamic behavior and risk assessments.\n- Adhere to the CCS Directive's legal framework for safe CO2 storage, covering site lifetime and integrating with existing EU environmental laws."
            }
        ]
    },
    {
        "region": "Indiana (United States)",
        "issues": [
            {
                "issue": "Long-term liability post-site closure",
                "regulation": "SB 442",
                "text": "The state of Indiana may obtain ownership of stored carbon dioxide and the underground strata and formations in which it is stored under the following conditions:\n\n1. After the operator has injected carbon dioxide into underground formations for at least 12 years.\n2. If the operator ceases injection before 12 years, ownership may be transferred immediately upon cessation.\n\nThe underground storage of carbon dioxide is declared a public use and service, in the public interest, and beneficial to the welfare of Indiana residents. A carbon sequestration pilot project is authorized to capture carbon dioxide at an ammonia production facility in West Terre Haute and inject it into underground formations through a Class VI well permit from the United States Environmental Protection Agency (EPA).\n\nIf the pilot project operator cannot reach an agreement with a property owner to acquire:\n- Ownership of underground formations beneath the surface, or\n- Rights to surface areas for monitoring facilities required by the EPA,\nthen the operator may exercise eminent domain to acquire these rights. \n\nThe eminent domain process must follow Indiana’s gas storage condemnation laws, requiring the operator to have acquired at least 60% of the formation through other means before proceeding with condemnation.\n\nThe state of Indiana, upon recommendation from the director of the Department of Natural Resources and review by the state budget committee, may assume ownership of:\n- The carbon dioxide stored in underground formations, and\n- The underground formations themselves, 12 years after injection begins, or sooner if injections cease earlier.\n\nThe legislative council is urged to assign an interim study committee to examine the geologic storage of carbon dioxide.",
                "year": 2019,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Ensure carbon dioxide injection continues for at least 12 years or prepare for immediate ownership transfer to the state if injection ceases earlier, and acquire necessary rights for monitoring facilities, using eminent domain if needed, after securing 60% of the formation.",
                "summary": "- Ensure carbon dioxide injection has occurred for at least 12 years before the state of Indiana can assume ownership of stored CO2 and underground formations.\n- Allow immediate transfer of ownership if injection ceases before the 12-year mark.\n- Recognize underground CO2 storage as a public use and service beneficial to Indiana residents.\n- Authorize a carbon sequestration pilot project at an ammonia facility in West Terre Haute, requiring a Class VI well permit from the EPA.\n- Exercise eminent domain if necessary, but only after acquiring at least 60% of the formation through other means, following Indiana’s gas storage condemnation laws.\n- Recommend the state of Indiana to assume ownership of stored CO2 and formations upon recommendation from the Department of Natural Resources and review by the state budget committee.\n- Urge the legislative council to assign an interim study committee to examine geologic CO2 storage.",
                "link": ""
            }
        ]
    },
    {
        "region": "Kansas (United States)",
        "issues": [
            {
                "issue": "Financial assurances of long-term site stewardship",
                "regulation": "HB 2419",
                "text": "New Sec. 3\n\n(a) (1) There is hereby established in the state treasury the carbon dioxide injection well and underground storage fund to administer the provisions of sections 2 through 5, and amendments thereto. Such fund shall be administered by the commission in accordance with the provisions of this section.\n(2) The commission shall remit to the state treasurer in accordance with the provisions of K.S.A. 75-4215, and amendments thereto, all moneys received by the commission for the purposes of sections 2 through 5, and amendments thereto. Upon receipt of the remittance the state treasurer shall deposit the entire amount in the state treasury and credit it to the fund. The commission is authorized to receive from any private or governmental source any funds made available for the purposes of sections 2 through 5, and amendments thereto.\n(3) All expenditures from the carbon dioxide injection well and underground storage fund shall be made in accordance with appropriation acts and upon warrants of the director of accounts and reports issued pursuant to vouchers approved by the chairperson of the commission or a person designated by the chairperson.\n\n(b) The commission is authorized to use moneys from the carbon dioxide injection well and underground storage fund to pay the cost of:\n(1) All activities related to permitting activities, including but not limited to, development and issuance of permits, compliance monitoring, inspections, well closures, underground storage closure, long-term monitoring and enforcement actions;\n(2) review and witnessing of test procedures;\n(3) review and witnessing of routine workover or repair procedures;\n(4) investigation of violations, complaints, pollution and events affecting public health;\n(5) design and review of remedial action plans;\n(6) contracting for services needed to supplement the commission’s staff expertise in facility investigations;\n(7) consultation needed concerning remedial action at a permitted facility;\n(8) mitigation of adverse environmental impacts;\n(9) emergency or long-term remedial activities;\n(10) legal costs, including expert witnesses, incurred in administration of the provisions of sections 2 through 5, and amendments thereto; and\n(11) costs of program administration.\n\n(c) On or before the 10th of each month, the director of accounts and reports shall transfer from the state general fund to the carbon dioxide injection well and underground storage fund interest earnings based on:\n(1) The average daily balance of moneys in the carbon dioxide injection well and underground storage fund for the preceding month; and\n(2) the net earnings rate of the pooled money investment portfolio for the preceding months.\n\nNew Sec. 4. (a) The commission, upon a finding that a person has violated any provision of section 2, and amendments thereto, or rules and regulations adopted thereunder, may impose a penalty not to exceed $10,000 per violation which shall constitute an economic deterrent to the violation for which it is assessed and, in the case of a continuing violation, every day such violation continues shall be deemed a separate violation.\n(b) No penalty shall be imposed pursuant to this section except after an opportunity for hearing upon the written order of the commission to the person who committed the violation. The order shall state the violation and the penalty to be imposed.\n(c) Whenever the commission or the commission’s duly authorized agents find that the escape of carbon dioxide into the atmosphere from injection of carbon dioxide is not being prevented or that the soil or waters of the state are not being protected from pollution resulting from injection of carbon dioxide, the commission or the commission’s duly authorized agents shall issue an order prohibiting such injection. Any person aggrieved by such order may request in writing, within 15 days after service of the order, a hearing on the order. Upon receipt of a timely request, a hearing shall be conducted in accordance with the provisions of the Kansas administrative procedure act.\n(d) Any action of the commission pursuant to this section is subject to review in accordance with the act for judicial review and civil enforcement of agency actions.\n\nThe Carbon Dioxide Reduction Act (HB 2419)\n\nThis bill directs the Kansas Corporation Commission to establish regulations for permitting CO2 storage facilities and creates a CO2 storage fund to cover expenses related to permitting, enforcement, long-term monitoring, and post-closure remediation.",
                "year": 2007,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Establish and maintain financial assurances for long-term site stewardship by contributing to the carbon dioxide injection well and underground storage fund as required by the commission.",
                "summary": "- Establish a carbon dioxide injection well and underground storage fund in the state treasury to manage financial assurances for long-term site stewardship.\n- Ensure the commission administers the fund in compliance with the provisions of HB 2419, including receiving funds from private or governmental sources.\n- Use the fund to cover costs related to permitting, compliance monitoring, inspections, well closures, long-term monitoring, enforcement actions, and remedial activities.\n- Transfer interest earnings from the state general fund to the storage fund monthly, based on the average daily balance and net earnings rate.\n- Impose penalties up to $10,000 per violation for non-compliance, with each day of continued violation considered a separate offense.\n- Conduct hearings before imposing penalties, ensuring due process for violators.\n- Issue orders to prohibit CO2 injection if it results in atmospheric escape or pollution, with a provision for aggrieved parties to request a hearing.\n- Subject commission actions to judicial review and civil enforcement under the Kansas administrative procedure act.",
                "link": ""
            }
        ]
    },
    {
        "region": "Louisiana (United States)",
        "issues": [
            {
                "issue": "Long-term liability post-site closure",
                "regulation": "Louisiana Geologic Sequestration of Carbon Dioxide Act",
                "text": "Liability and ownership transfer provisions:\n\n1. Ten years after cessation of CO2 injection (or another timeframe established by rule), the commissioner shall issue a certificate of completion of injection operations if the storage operator demonstrates that the reservoir retains mechanical integrity and the CO2 remains emplaced. Ownership of the project, including the stored CO2, transfers to the state at this time.\n2. Upon issuance of the certificate, the storage operator, CO2 generators, CO2 owners, and all parties with an interest in the facility are released from liability for any obligations arising after the certificate's issuance.\n3. If the Carbon Dioxide Geologic Storage Trust Fund lacks sufficient funds to address future obligations, liability release does not apply to the last operator or owner of record.\n4. Liability release does not apply to any party that intentionally concealed or misrepresented material facts regarding the facility’s mechanical integrity or the chemical composition of injected CO2.\n5. Upon certificate issuance, performance bonds posted by the operator are released, and continued monitoring and remediation (including well leakage) become the responsibility of the Carbon Dioxide Geologic Storage Trust Fund.\n6. The state assumes ownership of the storage facility but does not assume liability solely due to ownership transfer.\n\nThe Act grants the Department of Natural Resources regulatory authority over CO2 transportation and storage. It also authorizes the state to exercise eminent domain for CO2 storage projects, assume long-term responsibility for storage sites, and establish a CO2 storage fund to cover long-term site management costs.",
                "year": 2009,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Demonstrate reservoir mechanical integrity and CO2 emplacement to obtain a certificate of completion and transfer ownership and liability to the state.",
                "summary": "- Ensure the storage operator demonstrates reservoir mechanical integrity and CO2 emplacement for certificate issuance.\n- Transfer project ownership, including stored CO2, to the state ten years post-injection cessation or as per regulatory timeframe.\n- Release liability for storage operators and related parties upon certificate issuance, except if the Trust Fund is insufficient or if there was intentional misrepresentation.\n- Retain liability for parties concealing or misrepresenting facility integrity or CO2 composition.\n- Release operator performance bonds upon certificate issuance; Trust Fund assumes monitoring and remediation responsibilities.\n- Recognize state ownership of storage facilities post-certificate without assuming liability due to ownership transfer.\n- Acknowledge the Department of Natural Resources' authority over CO2 transportation and storage.\n- Utilize eminent domain for CO2 storage projects and establish a CO2 storage fund for long-term management.",
                "link": ""
            },
            {
                "issue": "Permitting and authorisation",
                "regulation": "Louisiana Revised Statute 30:1109",
                "text": "The Louisiana Revised Statute 30:1109 establishes the permitting and eminent domain authority for CO2 storage operators.\n\n**Eminent Domain and Expropriation Authority**\n1. A storage operator, after obtaining the necessary permits and a certificate of public convenience and necessity from the commissioner, may exercise eminent domain to acquire surface and subsurface rights for:\n   - Constructing, operating, or modifying a CO2 storage facility.\n   - Developing necessary infrastructure, including pipelines for transporting CO2 to storage facilities.\n   - Laying, maintaining, and operating utility, telegraph, and telephone lines essential to storage operations.\n2. The right of eminent domain extends to:\n   - Crossing navigable streams, public highways, streets, bridges, and other public places.\n   - Crossing railroads, street railways, and other pipelines under general state expropriation laws.\n   - Running pipelines along, over, or under public roads and highways, provided that traffic is not disrupted and roads are restored to their original condition.\n\n**Compensation and Public Road Use**\n- Storage facility operators must compensate municipalities, parishes, or road districts for damages incurred during pipeline construction along public roads.\n- Public streets and alleys within cities, towns, or villages cannot be used without explicit permission from the local governing authority.\n\n**Protection of Storage Facilities and Landowner Rights**\n- Landowners retain the right to drill through a storage facility, provided that drilling complies with state regulations to prevent pollution, CO2 escape, or migration.\n- The eminent domain authority does not infringe upon the rights of landowners or mineral rights holders whose land is not part of the acquired storage facility.\n\n**Legal Process and Commissioner’s Role**\n- The eminent domain process follows the procedures outlined in R.S. 19:2 and supplements other eminent domain powers granted by law.\n- The commissioner is not a necessary party in eminent domain proceedings and must be dismissed from any legal action if named as a party, with the responsible party covering all incurred costs, including attorney fees.\n\n**Regulatory Framework**\nThe Louisiana Geologic Sequestration of Carbon Dioxide Act:\n- Grants the Department of Natural Resources regulatory authority over CO2 transportation and storage.\n- Authorizes the state to assume long-term responsibility and liability for storage sites.\n- Establishes a CO2 storage fund to cover long-term site management costs.",
                "year": 2009,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Obtain necessary permits and a certificate of public convenience and necessity, compensate for damages during construction, and secure local permission for using public streets and alleys.",
                "summary": "- Ensure storage operators obtain necessary permits and a certificate of public convenience and necessity from the commissioner before exercising eminent domain.\n- Allow storage operators to acquire surface and subsurface rights for constructing and operating CO2 storage facilities and necessary infrastructure.\n- Permit the use of eminent domain to cross navigable streams, public highways, and other public areas, ensuring compliance with state expropriation laws.\n- Require compensation to municipalities, parishes, or road districts for damages during pipeline construction along public roads.\n- Obtain explicit permission from local governing authorities before using public streets and alleys within cities, towns, or villages.\n- Protect landowner rights by allowing drilling through storage facilities, ensuring compliance with state regulations to prevent pollution or CO2 escape.\n- Follow the legal process for eminent domain as outlined in R.S. 19:2, excluding the commissioner from proceedings and covering all related costs if named.\n- Recognize the Department of Natural Resources' regulatory authority over CO2 transportation and storage as per the Louisiana Geologic Sequestration of Carbon Dioxide Act.\n- Acknowledge the state's long-term responsibility and liability for storage sites and the establishment of a CO2 storage fund for site management costs.",
                "link": ""
            },
            {
                "issue": "Financial assurances of long-term site stewardship",
                "regulation": "Louisiana Geologic Sequestration of Carbon Dioxide Act",
                "text": "1110. Carbon Dioxide Geologic Storage Trust Fund\n\nA. (1) There is hereby established a fund in the custody of the state treasurer to be known as the Carbon Dioxide Geologic Storage Trust Fund, hereinafter referred to as the fund, which shall constitute a special custodial trust fund which shall be administered by the commissioner, who shall make disbursements from the fund solely in accordance with the purposes and uses authorized by this Chapter.\n\n(2) After compliance with the requirements of Article VII, Section 9(B) of the Constitution of Louisiana relative to the Bond Security and Redemption Fund, and after a sufficient amount is allocated from that fund to pay all of the obligations secured by the full faith and credit of the state which become due and payable within any fiscal year, the treasurer shall pay into the fund, an amount equal to the monies received by the state treasury pursuant to this Chapter. The monies in this fund shall be used solely as provided in this Section and only in the amount appropriated by the legislature. All unexpended and unencumbered monies remaining in this fund at the end of the fiscal year shall remain in the fund. The monies in the fund shall be invested by the state treasurer in the same manner as monies in the state general fund and all returns of such investment shall be deposited to the fund. The funds received shall be placed in the special trust fund in the custody of the state treasurer to be used only in accordance with this Chapter and shall not be placed in the general fund. The funds provided to the commissioner pursuant to this Section shall at all times be and remain the property of the commissioner. The funds shall be used only for the purposes set forth in this Chapter and for no other governmental purposes, nor shall any branch of government be allowed to borrow any portion of the funds. It is the intent of the legislature that this fund and its increments shall remain intact and inviolate.\n\nB. The following monies shall be placed into the fund:\n(1) The fees, penalties, and bond forfeitures collected pursuant to this Chapter. All fees and self-generated revenue remaining on deposit for the office of conservation at the end of any fiscal year shall be deposited into the fund.\n(2) Private contributions.\n(3) Interest earned on the funds deposited in the fund.\n(4) Civil penalties for violation of any rules or permit conditions imposed under this Chapter, or costs recovered from responsible parties for geologic storage facility closure or remediation pursuant to this Section and R.S. 30:1104, 1105, and 1106.\n(5) Any grants, donations, and sums allocated from any source, public or private, for the purposes of this Chapter.\n(6) Site-specific trust accounts; however, the monies of such accounts shall not be used for any geologic storage facility other than that specified for each respective account.\n\nC. The commissioner is hereby authorized to levy on storage operators the following fees or costs for the purpose of funding the fund:\n(1) A fee payable to the office of conservation, in a form and schedule prescribed by the office of conservation, for each ton of carbon dioxide injected for storage. This fee is to be determined based upon the following formula:\n(a) F x 120 < M\n(b) F is a per unit fee in dollars per ton set by the office of conservation.\n(c) 120 is the minimum number of months over which a fee is to be collected.\n(d) M is the Maximum Payment of five million dollars and is the total amount of fees to be collected before the payment of the fee can be suspended as provided in this Section.\n(e) The fee cannot exceed five million dollars divided by one hundred twenty divided by the total tonnage of carbon dioxide to be injected, (($5,000,000/120)/ total injection tonnage of carbon dioxide).\n(f) Once a storage operator has contributed five million dollars to the trust fund, the fee assessments to that storage operator under this Section shall cease until such time as funds begin to be expended for monitoring and caretaking of any completed storage facility. The treasurer of the state of Louisiana shall certify, to the commissioner, the date on which the balance in the fund for a storage operator equals or exceeds five million dollars. The fund fees shall not be collected or required to be paid on or after the first day of the second month following the certification, except that the commissioner shall resume collecting the fees on receipt of a certification from the treasurer that, based on the expenditures or commitments to expend monies, the fund has fallen below four million dollars for the storage operator. If at any time the balance in the trust fund exceeds an authorized amount determined by multiplying five million dollars by the number of active and completed storage facilities within the state, the collection of fees from the operators of storage facilities that have already contributed five million dollars to the trust fund will be suspended until such time as the balance in the trust fund falls below such authorized amount, at which time they will be reinstated.\n\nLouisiana Geologic Sequestration of Carbon Dioxide Act\n\nThis bill authorises the Department of Natural Resources to regulate CO2 transportation and storage. It grants the state government the power of eminent domain for CO2 storage projects, authorises the state to assume long-term storage site responsibility and liability, and creates a CO2 storage fund to cover the long-term costs associated with the storage site.",
                "year": 2009,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Establish and maintain contributions to the Carbon Dioxide Geologic Storage Trust Fund by paying the required fees for each ton of CO2 injected, until the specified financial thresholds are met.",
                "summary": "- Establish a Carbon Dioxide Geologic Storage Trust Fund under the custody of the state treasurer, administered by the commissioner, for long-term site stewardship.\n- Ensure all funds, including fees, penalties, private contributions, interest, civil penalties, and grants, are deposited into this trust fund and used solely for authorized purposes.\n- Levy fees on storage operators for each ton of CO2 injected, with a maximum contribution of five million dollars per operator, to fund the trust.\n- Suspend fee collection once an operator's contribution reaches five million dollars, resuming only if the fund balance falls below four million dollars.\n- Maintain the fund's integrity by prohibiting its use for any purposes other than those specified in the regulation, ensuring it remains intact and inviolate.\n- Monitor the fund balance and adjust fee collection based on the number of active and completed storage facilities, suspending fees if the balance exceeds the authorized amount.",
                "link": ""
            }
        ]
    },
    {
        "region": "Montana (United States)",
        "issues": [
            {
                "issue": "Long-term liability post-site closure",
                "regulation": "SB 498",
                "text": "The Montana Board of Oil and Gas Conservation regulates carbon sequestration under SB 498, establishing requirements for site closure, liability transfer, and long-term monitoring of CO2 storage sites.\n\n**Section 4: Certificate of Completion and Liability Transfer**\n1. A certificate of project completion is issued after CO2 injection ends and completion of certification requirements.\n2. The board must adopt rules for public notice, hearings, and administrative procedures related to certification.\n3. The certificate cannot be issued until at least 15 years after CO2 injections end.\n\n**Certification Requirements**\nA certificate may be issued only if the geologic storage operator:\n- Complies fully with all regulations governing the storage site.\n- Demonstrates that the reservoir will permanently retain stored CO2.\n- Confirms that all wells, equipment, and facilities used in the post-closure period are in good condition and maintain mechanical integrity.\n- Has plugged wells, removed equipment and facilities, and completed all required reclamation work.\n- Shows that the stored CO2 has reached stability, meaning it is stationary, chemically combined, or unlikely to migrate beyond the reservoir boundary.\n- Provides financial security for at least 15 years following the issuance of the certificate of completion and continues to accept liability for the storage site.\n\n**Monitoring and Liability Transfer**\n1. The board oversees monitoring of the storage site for 15 years after certification to verify compliance with regulations.\n2. After the monitoring period, if the operator holds the title to the geologic storage reservoir and the stored CO2, they may transfer ownership to the state.\n3. Prior to title transfer, monitoring must confirm:\n   - The site complies with all regulations.\n   - The reservoir maintains structural integrity, preventing CO2 migration or contamination of drinking water supplies.\n4. The board of land commissioners makes the final decision on title transfer.\n\n**Effects of Liability Transfer**\nIf liability is transferred to the state:\n- Ownership of the storage site and CO2 transfers to the state without compensation.\n- The state assumes all rights, interests, and responsibilities for the storage site.\n- The storage operator and CO2 generators are released from all regulatory requirements and liability.\n- Any bonds or financial sureties posted by the operator are released.\n- The state assumes responsibility for long-term monitoring and management until the federal government takes over these duties.\n\n**Continued Operator Liability**\n- If the operator chooses not to transfer title to the state, they remain liable indefinitely unless they later meet the conditions for transfer.\n- Every 15 years after monitoring completion, an operator may petition the board to transfer liability to the state, subject to review.\n\n**Regulatory Framework**\nSB 498 establishes:\n- The Montana Board of Oil and Gas Conservation as the regulatory authority over CCUS activities.\n- Pore space ownership as belonging to the surface owner.\n- A state-managed storage fund to support long-term stewardship of CO2 storage sites.\n\nThe bill provides a structured approach to geologic storage site closure, liability transfer, and long-term monitoring to ensure environmental safety and regulatory compliance.",
                "year": 2009,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Ensure compliance with all certification requirements, maintain site integrity, provide financial security for 15 years post-certification, and either transfer liability to the state or continue monitoring and accepting liability indefinitely.",
                "summary": "- Ensure compliance with all regulations governing the storage site before issuing a certificate of project completion.\n- Wait at least 15 years after CO2 injections end before issuing the certificate of completion.\n- Adopt rules for public notice, hearings, and administrative procedures related to certification.\n- Confirm that the reservoir will permanently retain stored CO2 and that all wells, equipment, and facilities maintain mechanical integrity.\n- Complete all required reclamation work, including plugging wells and removing equipment.\n- Provide financial security for at least 15 years following the issuance of the certificate of completion.\n- Monitor the storage site for 15 years post-certification to verify compliance with regulations.\n- Ensure that the reservoir maintains structural integrity and prevents CO2 migration or contamination of drinking water.\n- Allow the operator to transfer ownership of the storage site and CO2 to the state after the monitoring period, subject to compliance verification.\n- Release the operator and CO2 generators from all regulatory requirements and liability upon state assumption of ownership.\n- Maintain the option for operators to retain liability indefinitely if they choose not to transfer title to the state.\n- Permit operators to petition for liability transfer every 15 years after monitoring completion, subject to review.\n- Recognize the Montana Board of Oil and Gas Conservation as the regulatory authority over CCUS activities.\n- Acknowledge that pore space ownership belongs to the surface owner.\n- Utilize a state-managed storage fund for long-term stewardship of CO2 storage sites.",
                "link": ""
            },
            {
                "issue": "Financial assurances of long-term site stewardship",
                "regulation": "SB 498",
                "text": "Section 2. Geologic storage reservoir administrative fee -- account established\n\n(1) (a) A geologic storage operator shall pay to the board a fee on each ton of carbon dioxide injected for storage for the purpose of carrying out the state's responsibility to monitor and manage geologic storage reservoirs. If a geologic storage operator chooses to indefinitely accept liability pursuant to [SECTION 4(9)(A)], the board shall remit the fee to the operator. If a geologic storage operator is required to maintain liability pursuant to [section 4(9)(b)], the board may not remit the fee.\n(b) The fee must be in the amount set by board rule.\n(c) The amount must be based on the anticipated actual expenses that the board will incur in monitoring and managing geologic storage reservoirs during their post closure phases.\n\n(2) There is a geologic storage reservoir program account in the special revenue fund.\n\n(3) (a) Each fiscal year there must be deposited in the account the fees collected pursuant to [SECTION 5(2)(B)] and subsection (1) of this section, to be used by the board for monitoring and managing geologic reservoirs pursuant to [SECTION 4(6) AND (8)].\n(b) Funds received from bonds or other surety as authorized in 82-11-123(1)(f) and [SECTION 4] must be deposited in the account.\n\n(4) Interest and earnings on the funds in the geologic storage reservoir program account accrue to that account.\n\nAn Act Regulating Carbon Sequestration (SB 498)\n\nThis bill authorises the Montana Board of Oil and Gas Conservation to regulate CCUS activities. It specifies that pore space ownership rests with the surface owner, and authorises the state to assume liability for closed geologic storage sites. Additionally, this bill creates a storage fund.",
                "year": 2009,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Pay the board a fee per ton of carbon dioxide injected for storage, as set by board rule, to fund the monitoring and management of geologic storage reservoirs.",
                "summary": "- Ensure geologic storage operators pay a fee per ton of CO2 injected for storage to cover state monitoring and management responsibilities.\n- Verify if operators choose to accept liability indefinitely, as fees will be remitted to them; otherwise, fees are retained by the board.\n- Set fee amounts based on anticipated actual expenses for post-closure monitoring and management of storage reservoirs.\n- Deposit collected fees and funds from bonds or surety into the geologic storage reservoir program account within the special revenue fund.\n- Use account funds exclusively for monitoring and managing geologic reservoirs as specified in the regulation.\n- Accumulate interest and earnings on the program account funds to enhance financial resources for reservoir management.\n- Recognize that the Montana Board of Oil and Gas Conservation regulates CCUS activities, with pore space ownership assigned to surface owners.\n- Note that the state assumes liability for closed geologic storage sites, supported by the creation of a storage fund.",
                "link": ""
            }
        ]
    },
    {
        "region": "Nebraska (United States)",
        "issues": [
            {
                "issue": "Long-term liability post-site closure",
                "regulation": "Nebraska Geologic Storage of Carbon Dioxide Act",
                "text": "The issuance of a certificate of project completion and transfer of liability follows these conditions:\n\n1. After carbon dioxide injections into a reservoir end, the storage operator may apply for a certificate of project completion.\n2. The certificate may only be issued following public notice, a hearing, and consultation with the Department of Environment and Energy and the Underground Injection Control program permitting authority.\n3. The storage operator must demonstrate:\n   - Full compliance with all laws governing the storage facility.\n   - Resolution of all pending claims regarding facility operations.\n   - Authorization of site closure from the applicable Underground Injection Control program permitting authority for each injection well.\n   - That all wells, equipment, and facilities to be used in the post-closure period are in good condition and maintain mechanical integrity.\n\nOnce the certificate is issued:\n- Ownership of the storage facility and stored CO2 transfers to the State of Nebraska without compensation.\n- The state assumes all rights, interests, and responsibilities related to the stored CO2.\n- The storage operator and CO2 generators are released from all regulatory requirements associated with the storage facility.\n- Any financial assurance provided by the storage operator is released.\n- The state is responsible for monitoring and managing the storage facility under the oversight of the commission.\n\nThe bill establishes a legal and regulatory framework for CO2 geologic storage in Nebraska, aligning injection well permitting with state and federal regulations. It clarifies pore space ownership, establishes a storage fund, and allows for site ownership and liability transfer to the government if specific conditions are met.",
                "year": 2021,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Apply for a certificate of project completion after injections end, ensuring compliance with laws, resolving claims, obtaining site closure authorization, and maintaining well integrity, followed by public notice, hearing, and consultation.",
                "summary": "- Ensure carbon dioxide injections have ceased before applying for a certificate of project completion.\n- Conduct a public notice and hearing, and consult with the Department of Environment and Energy and the Underground Injection Control program permitting authority before issuing the certificate.\n- Demonstrate full compliance with all relevant laws governing the storage facility.\n- Resolve all pending claims related to facility operations.\n- Obtain authorization for site closure from the Underground Injection Control program permitting authority for each injection well.\n- Verify that all wells, equipment, and facilities intended for post-closure use are in good condition and maintain mechanical integrity.\n- Recognize that once the certificate is issued, ownership and liability for the storage facility and stored CO2 transfer to the State of Nebraska without compensation.\n- Understand that the state assumes all rights, interests, and responsibilities for the stored CO2, releasing the storage operator and CO2 generators from regulatory requirements.\n- Note that any financial assurance provided by the storage operator is released upon certificate issuance.\n- Acknowledge that the state is responsible for monitoring and managing the storage facility under commission oversight.\n- Align injection well permitting with state and federal regulations, clarify pore space ownership, and establish a storage fund as part of the legal framework.",
                "link": ""
            },
            {
                "issue": "Ownership and title of CO2",
                "regulation": "Nebraska Geologic Storage of Carbon Dioxide Act",
                "text": "Sec. 19\n\n(1) After carbon dioxide injections into a reservoir end and upon application by the storage operator, the commission shall consider issuing a certificate of project completion.\n\n(2) The certificate may only be issued after public notice and hearing. The commission shall establish notice requirements for such hearing.\n\n(3) The certificate may only be issued after the commission has consulted with the Department of Environment and Energy and the Underground Injection Control program permitting authority.\n\n(4) The certificate may only be issued if the storage operator:\n(a) Is in full compliance with all laws governing the storage facility;\n(b) Shows that it has addressed all pending claims regarding the storage facility's operation;\n(c) Shows that it has received an authorization of site closure from the applicable underground injection control program permitting authority for each storage facility injection well; and\n(d) Shows that any wells, equipment, and facilities to be used in the post-closure period are in good condition and retain mechanical integrity.\n\n(5) Once a certificate is issued:\n(a) Title to the storage facility and to the stored carbon dioxide transfers, without payment of any compensation, to the State of Nebraska;\n(b) Title acquired by the state includes all rights and interests in, and all responsibilities associated with, the stored carbon dioxide;\n(c) The storage operator and all persons who generated any injected carbon dioxide streams are released from all regulatory requirements associated with the storage facility;\n(d) Any financial assurance provided by the storage operator shall be released; and\n(e) Monitoring and managing the storage facility is the state's responsibility to be overseen by the commission.\n\nNebraska Geologic Storage of Carbon Dioxide Act\n\nThis bill establishes a legal and regulatory framework for the geologic storage of CO2 in the state. The framework assigns a relevant authority to oversee and regulate facilities that inject and store CO2, aligns injection well permitting requirements with state and federal regulations, clarifies pore space ownership, establishes a storage fund, and allows for the transfer of site ownership and liability to the government if certain conditions are met.",
                "year": 2021,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Apply for a certificate of project completion after CO2 injections end, ensuring compliance with all legal requirements, addressing pending claims, obtaining site closure authorization, and maintaining facility integrity, to transfer ownership and liability to the State of Nebraska.",
                "summary": "- Ensure the storage operator applies for a certificate of project completion after CO2 injections end.\n- Verify public notice and hearing requirements are met before issuing the certificate.\n- Confirm consultation with the Department of Environment and Energy and the Underground Injection Control program authority.\n- Ensure the storage operator complies with all relevant laws, resolves pending claims, obtains site closure authorization, and maintains well integrity.\n- Transfer title of the storage facility and stored CO2 to the State of Nebraska upon certificate issuance.\n- Release the storage operator and CO2 generators from regulatory requirements once the certificate is issued.\n- Release any financial assurance provided by the storage operator upon certificate issuance.\n- Assign responsibility for monitoring and managing the storage facility to the state, overseen by the commission.\n- Align with Nebraska Geologic Storage of Carbon Dioxide Act for regulatory framework and liability transfer conditions.",
                "link": ""
            }
        ]
    },
    {
        "region": "New Mexico (United States)",
        "issues": [
            {
                "issue": "Permitting and authorisation",
                "regulation": "2012 New Mexico Statutes",
                "text": "The 2012 New Mexico Statutes establish the permitting and eminent domain authority for pipeline infrastructure related to petroleum, natural gas, and carbon dioxide transport.\n\nSec. 70-3-5: Eminent Domain Power\n1. Any person, firm, association, or corporation may exercise eminent domain to acquire the necessary right-of-way for:\n   - Construction, maintenance, and operation of pipelines.\n   - Microwave systems and structures.\n   - Other necessary facilities for conveying petroleum, natural gas, carbon dioxide gas, and their derivatives.\n2. The right-of-way must be located to minimize damage to private or public property while ensuring proper use and economical construction.\n3. The land and right-of-way must be acquired as per the Eminent Domain Code (42A-1-1 to 42A-1-33 NMSA 1978).\n4. Engineers, surveyors, and other employees involved in the project have the right to enter state, private, and public lands to conduct necessary surveys and examinations for route selection, with responsibility for any damages incurred.\n\nSubsection B:\n- The authorization for pipelines applies to trunk lines, including those owned or operated by public utilities or interstate pipelines connecting wells under a purchase or conveying contract.\n- The authorization does not apply to gathering lines unless they are owned or operated by public utilities or their affiliates, or their operations are regulated by the Public Regulation Commission.\n- A trunk line is defined as the main transmission line transporting petroleum, natural gas, or carbon dioxide gas from production areas to usage locations. Other pipelines used in transportation are classified as gathering lines.\n\nThe statute establishes legal mechanisms for acquiring rights-of-way for CO2 pipelines and regulates trunk and gathering line operations in compliance with state and federal requirements.",
                "year": 2012,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Obtain necessary permits and exercise eminent domain as per the Eminent Domain Code to acquire right-of-way for CO2 pipeline construction, ensuring minimal damage and compliance with state and federal regulations.",
                "summary": "- Ensure understanding of eminent domain authority for acquiring rights-of-way for pipeline infrastructure, including CO2 transport, as per Sec. 70-3-5.\n- Verify that the right-of-way acquisition minimizes damage to private or public property while ensuring proper use and economical construction.\n- Confirm compliance with the Eminent Domain Code (42A-1-1 to 42A-1-33 NMSA 1978) for land and right-of-way acquisition.\n- Allow engineers, surveyors, and project employees to enter state, private, and public lands for necessary surveys and examinations, ensuring responsibility for any damages.\n- Distinguish between trunk lines and gathering lines; trunk lines are main transmission lines, while gathering lines are not covered unless owned by public utilities or regulated by the Public Regulation Commission.\n- Ensure pipeline operations comply with both state and federal requirements, focusing on trunk and gathering line regulations.",
                "link": ""
            }
        ]
    },
    {
        "region": "North Dakota (United States)",
        "issues": [
            {
                "issue": "Long-term liability post-site closure",
                "regulation": "SB 2095",
                "text": "The issuance of a certificate of project completion and transfer of liability follows these conditions:\n\n1. After carbon dioxide injections into a reservoir end, the storage operator may apply for a certificate of project completion.\n2. The certificate may only be issued following public notice, a hearing, and consultation with the state department of health.\n3. The certificate cannot be issued until at least ten years after the end of CO2 injections.\n4. The storage operator must demonstrate:\n   - Full compliance with all laws governing the storage facility.\n   - Resolution of all pending claims regarding facility operations.\n   - Reasonable expectation that the reservoir will retain the stored CO2 permanently.\n   - Stability of the stored CO2, meaning it is either stationary or any migration is unlikely to cross the reservoir boundary.\n   - That all wells, equipment, and facilities used in the post-closure period are in good condition and maintain mechanical integrity.\n   - Completion of well plugging, equipment removal, and site reclamation as required by the commission.\n\nOnce the certificate is issued:\n- Ownership of the storage facility and stored CO2 transfers to the state without compensation.\n- The state assumes all rights, interests, and responsibilities related to the stored CO2.\n- The storage operator and CO2 generators are released from all regulatory requirements associated with the storage facility.\n- Any bonds posted by the storage operator are released.\n- The state is responsible for monitoring and managing the storage facility under the oversight of the commission until the federal government assumes responsibility for long-term monitoring and management.\n\nThe bill instructs the Industrial Commission to establish regulations for CO2 storage site permitting, provides for eminent domain and unitization, authorizes the state government to assume liability for closed storage sites, and creates a CO2 storage fund to cover long-term stewardship costs.",
                "year": 2009,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Apply for a certificate of project completion at least ten years after CO2 injections end, ensuring compliance with all legal requirements, resolving claims, demonstrating CO2 stability, and completing site reclamation.",
                "summary": "- Ensure the storage operator applies for a certificate of project completion after CO2 injections end.\n- Conduct public notice, a hearing, and consult with the state department of health before issuing the certificate.\n- Wait at least ten years post-CO2 injections before issuing the certificate.\n- Verify the storage operator's full compliance with all relevant laws.\n- Confirm resolution of all pending claims related to facility operations.\n- Assess the reservoir's capability to permanently retain stored CO2.\n- Ensure the stability of stored CO2, confirming it is stationary or unlikely to migrate beyond the reservoir boundary.\n- Check that all wells, equipment, and facilities maintain mechanical integrity and are in good condition.\n- Confirm completion of well plugging, equipment removal, and site reclamation as per commission requirements.\n- Transfer ownership of the storage facility and stored CO2 to the state upon certificate issuance.\n- Release the storage operator and CO2 generators from regulatory requirements post-certificate issuance.\n- Release any bonds posted by the storage operator.\n- Assign the state responsibility for monitoring and managing the storage facility until federal oversight begins.\n- Follow the Industrial Commission's regulations for CO2 storage site permitting.\n- Utilize eminent domain and unitization as authorized.\n- Recognize the state's liability assumption for closed storage sites.\n- Utilize the CO2 storage fund for long-term stewardship costs.",
                "link": ""
            }
        ]
    },
    {
        "region": "Northern Ireland (United Kingdom)",
        "issues": [
            {
                "issue": "Permitting and authorisation",
                "regulation": "The Storage of Carbon Dioxide (Licensing etc.) Regulations (Northern Ireland) 2015",
                "text": "The Regulations establish a legal framework for the permitting and authorization of CO2 storage, implementing relevant provisions of Council Directive 2009/31/EC. \n\nRegulation 7: Applications for a Storage Permit\n1. The license holder may apply for a storage permit under the conditions specified in the license.\n2. If the license includes an appraisal term, all required exploration must be completed before applying for a permit.\n3. The application must include:\n   - Name and address of the proposed operator.\n   - Evidence of compliance with Regulation 8(1)(a)-(d).\n   - Information on the CO2 to be stored, including quantity, sources, transport methods, composition, injection rates, pressures, and facility locations.\n   - Description of measures to prevent significant irregularities.\n   - Proposed monitoring, corrective measures, and post-closure plans.\n   - Proof of financial security meeting the requirements of Schedule 2, valid before injection begins.\n4. The application and supporting materials must be forwarded to the European Commission and the Department of the Environment.\n\nRegulation 8: Grant of Storage Permit\n1. Before granting a storage permit, the authority must ensure:\n   - The storage complex and surrounding area are sufficiently characterized and assessed.\n   - No part of the storage complex extends beyond member state territories.\n   - The proposed use of the storage site poses no significant risk of leakage or harm to the environment or human health.\n   - The operator is technically competent, financially sound, and has an appropriate professional and technical development program.\n2. Where multiple storage sites exist within the same hydraulic unit, all sites must meet the requirements simultaneously before any permit is granted.\n3. The authority may require modifications to the proposed monitoring and corrective measures plans before approving them.\n4. Before granting a permit, the authority must submit a draft to the European Commission and consider any feedback received.\n\nRegulation 9: Content of Storage Permits\nA storage permit must include at least the following:\n- Operator name and address.\n- Precise location and delimitation of the storage site and storage complex.\n- Operational requirements, including authorized storage capacity, reservoir pressure limits, and injection rates.\n- Provisions for CO2 acceptance and injection, including CO2 stream composition.\n- Monitoring, reporting, and corrective measures requirements.\n- Conditions for site closure and post-closure monitoring responsibilities.\n- Financial security provisions.\n\nThe Regulations govern the granting of CO2 storage permits, operator obligations (monitoring, reporting, corrective measures), post-closure responsibilities, and inspections. They provide a licensing regime for permanent offshore CO2 storage, including UK territorial waters adjacent to Northern Ireland, as established under the Energy Act 2008.",
                "year": 2015,
                "jurisdiction": "National",
                "status": "In force",
                "action_point": "Complete all required exploration, submit a comprehensive storage permit application with necessary documentation to the European Commission and the Department of the Environment, and ensure compliance with technical, environmental, and financial requirements.",
                "summary": "- Ensure the application for a storage permit includes all specified details: operator information, CO2 storage data, preventive measures, monitoring plans, and financial security proof as per Regulation 7.\n- Complete all required exploration if the license has an appraisal term before applying for a storage permit.\n- Forward the application and supporting materials to the European Commission and the Department of the Environment.\n- Verify that the storage complex and surrounding area are adequately characterized and assessed before granting a storage permit, as required by Regulation 8.\n- Confirm that the storage site does not extend beyond member state territories and poses no significant risk to the environment or human health.\n- Assess the operator's technical competence, financial stability, and professional development program.\n- Require modifications to monitoring and corrective measures plans if necessary before permit approval.\n- Submit a draft permit to the European Commission and consider their feedback before granting a permit.\n- Include in the storage permit all necessary details: operator information, site location, operational requirements, CO2 acceptance provisions, monitoring and reporting obligations, site closure conditions, and financial security provisions as outlined in Regulation 9.\n- Govern the granting of CO2 storage permits, operator obligations, and post-closure responsibilities under the established licensing regime for offshore CO2 storage, including UK territorial waters adjacent to Northern Ireland.",
                "link": ""
            },
            {
                "issue": "Site closure process",
                "regulation": "The Storage of Carbon Dioxide (Licensing etc.) Regulations (Northern Ireland) 2015",
                "text": "**Regulation 13: Post-closure plan**\n\n1. Before applying for a storage permit, a licence holder shall draw up a proposed provisional post-closure plan that is—\n   (a) based on best practice; and\n   (b) in accordance with Annex II to the Directive.\n\n2. Before granting a storage permit, the authority shall—\n   (a) approve that proposed plan; or\n   (b) require the licence holder to make such modifications to it as the authority (after consulting the licence holder) considers necessary, and the provisional post-closure plan is the plan so approved or modified.\n\n3. The authority may—\n   (a) approve a proposed post-closure plan submitted to it for approval in accordance with the provisions in the licence included by virtue of regulation 6 and paragraph 2(1) of Schedule 1; or\n   (b) require the operator to make such modifications to it as the authority (after consulting the operator) considers necessary, and the post-closure plan is the plan so approved or modified.\n\n4. Where the authority is deemed to be the operator pursuant to regulation 12(5), the post-closure plan is the provisional post-closure plan with such modifications as the authority considers necessary.\n\n**Regulation 14: Post-closure obligations**\n\nThe closure of a storage site is without prejudice to the obligations of the operator—\n   (a) under legislation implementing Articles 5 to 8 of the Environmental Liability Directive; or\n   (b) relating to the surrender of allowances under legislation implementing the ETS Directive.\n\n**The Storage of Carbon Dioxide (Licensing etc.) Regulations (Northern Ireland) 2015**\n\nThe purpose of the Regulations is to implement Articles 2.3, 2.4, 3, 4.3, 4.4, 5.1, 5.2, 5.3 and Chapter 3 (storage permits) (except Articles 18 and 20) of Council Directive 2009/31/EC on the geological storage of carbon dioxide (“the Directive”). The Regulations implement those provisions of the Directive which deal with storage permits, including:\n   1. The granting of permits for the operation of carbon dioxide storage sites (and related exploration activities);\n   2. The obligations of the storage operator (for example, in relation to monitoring, reporting and corrective measures) whilst storage activities are taking place;\n   3. The operator’s continuing obligations for a period after the closure of the storage site; and\n   4. The inspection of carbon dioxide storage complexes.\n\nThe purpose of the Directive is to establish a legal framework for the environmentally safe geological storage of carbon dioxide. Such a framework had been established in the UK by Part 1, Chapter 3, of the Energy Act 2008, which extends to Northern Ireland. The Act provided for a licensing regime governing the permanent storage of carbon dioxide offshore, including the UK territorial waters adjacent to Northern Ireland.",
                "year": 2015,
                "jurisdiction": "National",
                "status": "In force",
                "link": "https://www.legislation.gov.uk/nisr/2015/339/contents/made",
                "action_point": "Develop and submit a provisional post-closure plan based on best practices and in accordance with Annex II to the Directive for approval before applying for a storage permit.",
                "summary": "- Ensure the post-closure plan is based on best practices and aligns with Annex II of the Directive before applying for a storage permit.\n- Obtain approval for the provisional post-closure plan from the authority or modify it as required by the authority after consultation.\n- Recognize that the authority can approve or require modifications to the post-closure plan, ensuring compliance with the licensing provisions.\n- Understand that if the authority becomes the operator, it will modify the provisional post-closure plan as necessary.\n- Acknowledge that site closure does not exempt the operator from obligations under the Environmental Liability Directive or the ETS Directive.\n- Familiarize with the purpose of the regulations, which include granting storage permits, monitoring obligations, post-closure responsibilities, and inspection requirements.\n- Note that the regulations implement parts of the Council Directive 2009/31/EC, establishing a framework for safe geological storage of CO2, supported by the Energy Act 2008 in the UK."
            }
        ]
    },
    {
        "region": "Norway",
        "issues": [
            {
                "issue": "Long-term liability post-site closure",
                "regulation": "Regulations relating to Act relating to petroleum activities",
                "text": "Following the shutdown of a CO2 storage location, all obligations concerning monitoring and corrective measures shall be transferred to the State, represented by the Ministry of Petroleum and Energy or its authorized entity, if the following conditions are met:\n\n1. All available information indicates that the stored CO2 will remain entirely and permanently enclosed. The operator must document that the actual behavior of the injected CO2 matches the modeled behavior, that leakage cannot be proven, and that the storage location is developing toward a condition of permanent stability.\n2. A minimum period, not less than 20 years, has expired unless the Ministry is convinced that the CO2 storage is stable before the expiry of this period.\n3. The financial requirements specified in Section 30m have been fulfilled.\n4. The storage location has been prudently abandoned, and the injection facilities have been removed.\n\nThe operator shall submit a report to the Ministry documenting compliance with the stability conditions, including evidence that:\n- The injected CO2 behaves as modeled.\n- No leakage is detected.\n- The storage location is developing toward long-term stability.\n\nNo later than one month after receiving the report, the Ministry shall submit it to the EFTA Surveillance Authority. If the conditions for transfer of responsibility are not met, the application shall be rejected with justification. If approved, a draft specifying methods for sealing and removal of injection facilities shall be submitted to the EFTA Surveillance Authority, which may provide its opinion within four months.\n\nFollowing the transfer of responsibility, routine regulatory supervision will be suspended, and monitoring shall be limited to detecting leakage or significant irregularities. If irregularities occur, monitoring shall be intensified to assess the issue and corrective measures.\n\nIf the operator has negligently or intentionally made errors, including providing deficient data or withholding relevant information, the State may recover costs accrued after the transfer of responsibility from the previous operator.\n\nThe regulations provide rules for the capture, transport, and storage of CO2 in petroleum activities initiated under a development and operation plan approved pursuant to the Petroleum Activities Act Section 4-2, which requires Ministry approval for petroleum deposit development projects.",
                "year": 1997,
                "jurisdiction": "National",
                "status": "In force",
                "action_point": "Submit a report to the Ministry documenting compliance with CO2 stability conditions and ensure all financial and abandonment requirements are met for the transfer of long-term liability post-site closure.",
                "summary": "- Ensure all obligations for monitoring and corrective measures post-site closure are transferred to the State if conditions are met.\n- Verify that all available information confirms the CO2 will remain permanently enclosed; document that the injected CO2 behavior aligns with models, leakage is unproven, and the site is moving towards permanent stability.\n- Confirm a minimum of 20 years has passed since closure unless early stability is proven to the Ministry's satisfaction.\n- Fulfill financial requirements as per Section 30m.\n- Ensure the storage site is prudently abandoned and injection facilities removed.\n- Submit a compliance report to the Ministry, demonstrating CO2 behavior, absence of leakage, and site stability.\n- Expect the Ministry to forward the report to the EFTA Surveillance Authority within one month.\n- Prepare for potential rejection if conditions are unmet, with justification provided.\n- If approved, draft methods for sealing and facility removal for EFTA Surveillance Authority review within four months.\n- Post-transfer, expect routine supervision suspension; monitor only for leakage or irregularities.\n- Intensify monitoring if irregularities occur to assess and correct issues.\n- Be aware that costs may be recovered from the operator if negligence or intentional errors are found.",
                "link": ""
            },
            {
                "issue": "Permitting and authorisation",
                "regulation": "Regulations relating to exploitation of subsea reservoirs on the continental shelf for storage of CO2 and relating to transportation of CO2 on the continental shelf",
                "text": "The regulations establish a permitting framework for surveying, exploration, exploitation, transportation, and storage of CO2 in subsea reservoirs under Norwegian jurisdiction.\n\n**Section 4-1: Licence for Exploitation of Subsea Reservoirs for Injection and Storage of CO2**\n1. The King in Council may grant a licence for CO2 storage under specific conditions. The licence must specify the geographic coordinates and stratigraphic delineation of the geological units covered.\n2. Licences may be granted to one or more corporate entities registered in Norway, unless otherwise dictated by international agreements. If multiple entities hold the licence jointly, operations must be conducted at joint expense and risk.\n3. Licensees must demonstrate financial strength, technical and geological competence, and operational reliability to manage the storage site. All quality requirements for the licensee and its organization must be met.\n4. An exploration licence holder (under Section 3-1) applying for a CO2 storage licence within the exploration period will be given priority if work commitments (Section 3-3) and other licence conditions are met.\n5. A CO2 storage licence grants exclusive rights to store CO2 within the licensed area.\n6. Licences are awarded on objective, published, and non-discriminatory criteria.\n7. If a licence is granted to multiple participants, the government may require them to enter a partnership agreement, subject to Ministry approval.\n\n**Section 5-2: Consent for Injection and Storage of CO2**\n1. Licensees must obtain government consent before starting injection and storage of CO2.\n2. Consent is granted by the Ministry or its authorized entity, as well as the Ministry of Labour and Social Affairs or its authorized entity, in compliance with health, safety, and environmental regulations.\n3. The consent must align with a storage permit issued under the Pollution Regulations (Chapter 35 of Regulation No. 931 of 1 June 2004).\n4. Applications for injection and storage consent must include:\n   - Storage site location, geological reservoir details, and delineation.\n   - Injection operation details, including CO2 volume limits, reservoir pressure limits, and injection pressure limits.\n   - Monitoring plans in accordance with Appendix II of the Regulations.\n   - CO2 injection rate measurements.\n   - Corrective measures plans.\n   - Shutdown and post-operation plans.\n5. The Ministry of Petroleum and Energy must be notified in case of leaks or significant irregularities.\n\nThese regulations establish a clear legal and regulatory framework for licensing, storage site management, and compliance in CO2 storage activities within Norwegian jurisdiction.",
                "year": 2014,
                "jurisdiction": "National",
                "status": "In force",
                "action_point": "Obtain a CO2 storage licence and government consent by demonstrating financial, technical, and operational competence, and submit detailed plans for injection, monitoring, and corrective measures.",
                "summary": "- Ensure licences for CO2 storage are granted by the King in Council under specific conditions, including geographic and stratigraphic details (Section 4-1.1).\n- Confirm that licences can be issued to corporate entities registered in Norway, with joint operations requiring shared expense and risk (Section 4-1.2).\n- Verify licensees' financial, technical, and operational competence for managing storage sites (Section 4-1.3).\n- Prioritize exploration licence holders for CO2 storage licences if they meet work commitments and conditions (Section 4-1.4).\n- Recognize that CO2 storage licences provide exclusive rights within the licensed area (Section 4-1.5).\n- Award licences based on objective, published, and non-discriminatory criteria (Section 4-1.6).\n- Require partnership agreements for multiple licence holders, subject to Ministry approval (Section 4-1.7).\n- Obtain government consent before starting CO2 injection and storage, ensuring compliance with health, safety, and environmental regulations (Section 5-2.1, 5-2.2).\n- Align consent with a storage permit under Pollution Regulations (Section 5-2.3).\n- Include detailed applications for consent, covering site location, operation details, monitoring, corrective measures, and shutdown plans (Section 5-2.4).\n- Notify the Ministry of Petroleum and Energy of any leaks or significant irregularities (Section 5-2.5).",
                "link": ""
            },
            {
                "issue": "Financial assurances of long-term site stewardship",
                "regulation": "Regulations relating to exploitation of subsea reservoirs on the continental shelf for storage of CO2 and relating to transportation of CO2 on the continental shelf",
                "text": "Section 5-10: Financial mechanism\n\nBefore a transfer of responsibility takes place pursuant to Section 5-8, the operator shall make a financial contribution available to the State, represented by the Ministry of Petroleum and Energy, as specifically directed by the Ministry. The contribution shall take into account the criteria mentioned in Appendix I, as well as elements that relate to the historical storage of CO2 of relevance for stipulation of the obligations after the transfer. The financial contribution shall, as a minimum, cover anticipated monitoring expenses for a period of 30 years. The contribution may be used to cover the State's expenses after the transfer of responsibility to ensure that the CO2 is safely stored after the transfer of responsibility.\n\nRegulations relating to exploitation of subsea reservoirs on the continental shelf for storage of CO2 and relating to transportation of CO2 on the continental shelf\n\nThe regulations provide rules for surveying and exploration for subsea reservoirs for storage of CO2, as well as exploitation, transportation and storage of CO2 in such reservoirs in areas subject to Norwegian jurisdiction.",
                "year": 2014,
                "jurisdiction": "National",
                "status": "In force",
                "action_point": "Ensure a financial contribution covering at least 30 years of anticipated monitoring expenses is made available to the Ministry of Petroleum and Energy before transferring responsibility.",
                "summary": "- Ensure the operator provides a financial contribution to the State before transferring responsibility, as mandated by Section 5-10.\n- Verify that the financial contribution is directed by the Ministry of Petroleum and Energy and considers criteria in Appendix I, including historical CO2 storage data.\n- Confirm that the financial contribution covers at least 30 years of anticipated monitoring expenses post-transfer.\n- Use the financial contribution to cover State expenses for ensuring safe CO2 storage after responsibility transfer.\n- Apply these regulations to activities within areas under Norwegian jurisdiction, focusing on surveying, exploration, exploitation, transportation, and storage of CO2 in subsea reservoirs.",
                "link": ""
            },
            {
                "issue": "Measurement, monitoring and verification plans",
                "regulation": "Regulations relating to exploitation of subsea reservoirs on the continental shelf for storage of CO2 and relating to transportation of CO2 on the continental shelf",
                "text": "Section 5-4: Monitoring\n\nThe operator shall monitor the injection facilities and the storage complex, including the dispersion of CO2 in order to:\n  a) Compare the actual and modelled behaviour of the CO2 and the formation water in the storage location,\n  b) Identify significant irregularities,\n  c) Follow the migration of CO2,\n  d) Detect leaks of CO2 from the storage complex,\n  e) Update the assessment of the storage complex' safety and integrity over the short and long term, including whether the stored CO2 will remain safely stored.\n\nThe monitoring shall be conducted on the basis of a monitoring plan prepared by the operator in accordance with the requirements in Appendix II to these Regulations, and to which the Ministry has granted consent pursuant to Section 5-2.\n\nThe plan shall be updated in line with the requirements in Appendix II to these Regulations, and no less frequently than every five years. This is in order to handle any changes in the risk assessment linked to leaks and for the environment, human health, new scientific knowledge or technological improvements. Updated plans are subject to the Ministry's consent pursuant to Section 5-2.\n\nSection 5-5: Regulatory supervision\n\nThe Ministry or the entity it authorises shall superintend the storage location at least once per year up to three years after shutdown, and then every five years until the responsibility has been transferred to the State, represented by the Ministry of Petroleum and Energy. During these regulatory supervisions, the Ministry or the entity it authorises shall inspect relevant injection and monitoring facilities, reservoir conditions, and any effects of the storage complex on the environment. The regulatory supervision shall, insofar as possible, be coordinated with regulatory supervisions by the pollution authorities pursuant to Section 35-11 of Regulation No. 931 of 1 June 2004 relating to pollution control (the Pollution Regulations).\n\nFollowing each regulatory supervision, the Ministry or the entity it authorises shall prepare a report on the regulatory supervision results. The report shall assess whether the provisions in these Regulations have been adhered to, and whether additional measures are necessary. The report shall be submitted to the operator and made available to the public no later than two months after the regulatory supervision is complete.\n\nRegulations relating to exploitation of subsea reservoirs on the continental shelf for storage of CO2 and relating to transportation of CO2 on the continental shelf\n\nThe regulations provide rules for surveying and exploration for subsea reservoirs for storage of CO2, as well as exploitation, transportation and storage of CO2 in such reservoirs in areas subject to Norwegian jurisdiction.",
                "year": 2014,
                "jurisdiction": "National",
                "status": "In force",
                "action_point": "Prepare and update a monitoring plan for CO2 storage, obtain Ministry consent, and conduct monitoring to detect irregularities and ensure safety, with regulatory supervision and reporting by the Ministry.",
                "summary": "- Monitor injection facilities and storage complex to compare actual and modelled CO2 and formation water behavior, identify irregularities, track CO2 migration, detect leaks, and assess storage safety and integrity.\n- Prepare and update a monitoring plan every five years or as needed, based on Appendix II requirements, with Ministry consent required.\n- Conduct regulatory supervision annually for up to three years post-shutdown, then every five years, inspecting facilities, reservoir conditions, and environmental effects.\n- Coordinate regulatory supervision with pollution authorities as per Pollution Regulations.\n- Prepare and publicly release a report within two months post-supervision, assessing regulation adherence and necessary additional measures.\n- Ensure compliance with Norwegian jurisdiction rules for CO2 storage and transportation in subsea reservoirs.",
                "link": ""
            },
            {
                "issue": "Environmental impact assessments",
                "regulation": "Regulations relating to exploitation of subsea reservoirs on the continental shelf for storage of CO2 and relating to transportation of CO2 on the continental shelf",
                "text": "Section 4-8: Impact assessment in plans for development and operation of a subsea reservoir for injection and storage of CO2\n\nAn impact assessment in a plan for development and storage of CO2 in a subsea reservoir shall account for the effects the development may have for commercial and environmental circumstances, including preventive and mitigating measures. The impact assessment shall, e.g.:\n\n(a) Describe alternative development solutions the licensee has investigated and substantiate the chosen development solution and injection strategy, account for the criteria for the choice that has been made, as well as describe any subsequent development stages, connection to other subsea reservoirs for storage of CO2 [and onshore facilities] and any coordination of storage,\n(b) Describe the environment that may be significantly affected, and assess and consider environmental consequences of the development and storage, including: describe discharges to sea and emissions to air, describe any material assets and cultural artefacts that may be affected as a result of the development, assess the consequences of the chosen technical solutions, clarify how environmental criteria and consequences have been used as a basis for the chosen technical solutions, describe possible and planned measures to prevent, reduce and if possible compensate for considerable negative environmental impact,\n(c) Assess which permits, approvals or consents will be sought pursuant to other applicable legislation, whether or not a facility will be placed on the land territory, sea territory subject to private ownership rights, inland waters or the sea territory,\n(d) Assess how the facilities will be used upon cessation of the storage,\n(e) Assess facilities for transport or exploitation covered by Section 6-1 of the Regulations,\n(f) Assess technical measures for preparedness,\n(g) Assess how environmental monitoring in the area can be carried out,\n(h) Include a summary of the above-mentioned items.\n\nThe impact assessment shall be prepared based on the study programme stipulated pursuant to Section 4-7 and adapted to the scope of the development and to what extent the development is considered to be covered by an impact assessment for a larger overall area. The impact assessment shall be submitted to the Ministry no later than concurrently with a description of the development. In areas where multiple subsea reservoirs for storage of CO2 are to be developed, the licensee will be able to prepare an impact assessment for a larger overall area. A joint impact assessment may also be prepared for developments that are also subject to impact assessment pursuant to other legislation.\n\nIf the licensee substantiates that the development is covered by an existing relevant impact assessment for a subsea reservoir for storage of CO2 or for a larger overall area, an impact assessment will only be required if the Ministry finds this to be necessary.\n\nThe licensee shall submit the impact assessment to affected authorities and special interest organisations for statements and it will be announced at the same time in the Norwegian Gazette that the impact assessment has been submitted for consultation. The impact assessment and, insofar as possible, any relevant background documents, shall be made available on the Internet. A reasonable deadline shall be set for statements concerning the impact assessment. This deadline should be no less than six weeks. The Ministry may, in special instances, decide that the Ministry will submit the impact assessment for consultation.\n\nThe Ministry shall, on the basis of the consultation, decide whether or not there is a need for additional studies or documentation concerning certain aspects. Any additional studies shall be submitted to the affected authorities and those who have given their opinion on the impact assessment for statements before a decision is made in the case. This deadline for statements should be no less than two weeks.\n\nThe Ministry's case presentation shall state how the effects of the development and received statements have been assessed, and what significance they have been assigned. The case presentation shall assess whether conditions shall be set with a view toward restricting and compensating for negative effects of significance.\n\nThe Ministry's decisions pursuant to this Section are not individual administrative decisions pursuant to the Public Administration Act.\n\nRegulations relating to exploitation of subsea reservoirs on the continental shelf for storage of CO2 and relating to transportation of CO2 on the continental shelf\n\nThe regulations provide rules for surveying and exploration for subsea reservoirs for storage of CO2, as well as exploitation, transportation and storage of CO2 in such reservoirs in areas subject to Norwegian jurisdiction.",
                "year": 2014,
                "jurisdiction": "National",
                "status": "In force",
                "action_point": "Prepare and submit a comprehensive impact assessment for CO2 storage development plans, addressing environmental effects, alternative solutions, and necessary permits, and ensure consultation with authorities and public disclosure.",
                "summary": "- Ensure impact assessments account for commercial and environmental effects, including preventive and mitigating measures.\n- Describe alternative development solutions and justify the chosen strategy, including connections to other reservoirs and coordination of storage.\n- Detail environmental impacts, including discharges, emissions, and effects on material assets and cultural artefacts; outline preventive and compensatory measures.\n- Identify necessary permits and approvals under applicable legislation.\n- Evaluate facility use post-storage cessation and assess transport or exploitation facilities.\n- Include technical preparedness measures and environmental monitoring plans.\n- Prepare impact assessments based on the study programme and adapt to development scope; submit to the Ministry with development description.\n- Allow for joint impact assessments in areas with multiple reservoirs or under other legislation.\n- Submit impact assessments to authorities and interest groups for consultation with a minimum six-week deadline.\n- Ministry may require additional studies based on consultation feedback, with a minimum two-week deadline for further statements.\n- Ministry's case presentation must assess development effects and consultation feedback, considering conditions to mitigate negative impacts.\n- Note that Ministry decisions under this section are not individual administrative decisions per the Public Administration Act.\n- Regulations apply to surveying, exploration, exploitation, transportation, and storage of CO2 in Norwegian jurisdiction subsea reservoirs.",
                "link": ""
            },
            {
                "issue": "Operational liabilities and financial security",
                "regulation": "Regulations relating to exploitation of subsea reservoirs on the continental shelf for storage of CO2 and relating to transportation of CO2 on the continental shelf",
                "text": "Section 8-3: The responsible party and scope of liability\n\nThe licensee is liable for pollution damage regardless of guilt. The provisions concerning the licensee's responsibility shall apply equivalently to an operator that is not a licensee when the Ministry of Petroleum and Energy has so decided through approval of operator status.\n\nIf the Ministry of Petroleum and Energy has made a decision pursuant to the first paragraph, compensation claims shall first be directed to the operator. In the event that any part of the compensation is not covered by the operator upon maturity, it shall be covered by the licensees according to their ownership interest in the permit. If any party does not cover its share, this shall be distributed proportionately among the others.\n\nIf it is substantiated that an unavoidable natural occurrence, act of war, act of public authorities or similar force majeure has considerably contributed to the damage or its scope under circumstances that are outside the control of the responsible party, the responsibility can be reduced insofar as reasonable, taking into particular consideration the scope of the activities, the sufferer's situation and insurance options on both sides.\n\nIn the event of pollution damage from facilities in areas outside the Norwegian continental shelf, the party authorised by the competent authority to conduct the activities with which the facility is associated, shall be regarded as the licensee.\n\nRegulations relating to exploitation of subsea reservoirs on the continental shelf for storage of CO2 and relating to transportation of CO2 on the continental shelf\n\nThe regulations provide rules for surveying and exploration for subsea reservoirs for storage of CO2, as well as exploitation, transportation and storage of CO2 in such reservoirs in areas subject to Norwegian jurisdiction.",
                "year": 2014,
                "jurisdiction": "National",
                "status": "In force",
                "link": "https://www.sodir.no/en/regulations/regulations/exploitation-of-subsea-reservoirs-on-the-continental-shelf-for-storage-of-and-transportation-of-co/",
                "action_point": "Ensure liability coverage for pollution damage and direct compensation claims to the operator, with licensees covering any shortfall according to ownership interest, unless reduced by force majeure circumstances.",
                "summary": "- Understand that the licensee is strictly liable for pollution damage, regardless of fault.\n- Recognize that operator liability applies if approved by the Ministry of Petroleum and Energy.\n- Direct initial compensation claims to the operator; if unpaid, distribute liability among licensees based on ownership.\n- Note that force majeure events can reduce liability if they significantly contribute to damage.\n- Identify the authorized party as the licensee for facilities outside the Norwegian continental shelf.\n- Ensure compliance with regulations for CO2 storage and transportation on the Norwegian continental shelf."
            },
            {
                "issue": "Storage resource assessment",
                "regulation": "Regulations relating to exploitation of subsea reservoirs on the continental shelf for storage of CO2 and relating to transportation of CO2 on the continental shelf",
                "text": "**Section 1-10: Selecting a storage location**\n\nA subsea reservoir's suitability as a storage location shall be determined through a characterisation and assessment of a potential storage location and surrounding area according to the criteria listed in Appendix 1. A subsea reservoir shall only be selected as a storage location if there, under the conditions proposed for such use, is not a significant risk of leakage, and there is also not considered to be any risk of health or environmental damage of significance.\n\n**Regulations relating to exploitation of subsea reservoirs on the continental shelf for storage of CO2 and relating to transportation of CO2 on the continental shelf**\n\nThe regulations provide rules for surveying and exploration for subsea reservoirs for storage of CO2, as well as exploitation, transportation and storage of CO2 in such reservoirs in areas subject to Norwegian jurisdiction.",
                "year": 2014,
                "jurisdiction": "National",
                "status": "In force",
                "link": "https://www.sodir.no/en/regulations/regulations/exploitation-of-subsea-reservoirs-on-the-continental-shelf-for-storage-of-and-transportation-of-co/",
                "action_point": "\"Conduct a thorough characterisation and assessment of the subsea reservoir and surrounding area to ensure no significant risk of leakage or health and environmental damage before selecting it as a storage location.\"",
                "summary": "- Ensure the suitability of a subsea reservoir for CO2 storage through comprehensive characterization and assessment as per criteria in Appendix 1.\n- Select a subsea reservoir only if there is no significant risk of CO2 leakage under proposed conditions.\n- Confirm that there is no significant risk of health or environmental damage associated with the storage location.\n- Follow the regulations for surveying, exploration, exploitation, transportation, and storage of CO2 in subsea reservoirs under Norwegian jurisdiction.\n- Adhere strictly to the guidelines provided in the regulations to ensure compliance and safety."
            },
            {
                "issue": "Site closure process",
                "regulation": "Regulations relating to exploitation of subsea reservoirs on the continental shelf for storage of CO2 and relating to transportation of CO2 on the continental shelf",
                "text": "**Section 5-7: Shutdown and Post-Operation**\n\nA storage location shall be shut down if:\n(a) The conditions stipulated for shutdown in the storage licence issued by the pollution authorities pursuant to **Chapter 35 of Regulation No. 931 of 1 June 2004** relating to pollution control (the Pollution Regulations) and in the consent for injection and storage have been fulfilled.\n(b) The King consents to the shutdown on the basis of an application from the operator.\n\nFrom the time a storage location is shut down under **(1)(a) or (b)** and until responsibility for the storage location is transferred to the State, represented by the **Ministry of Petroleum and Energy**, pursuant to **Section 5-8(1) and (6)**, the operator remains responsible for:\n- Monitoring,\n- Reporting,\n- Implementation of corrective measures,\n- Sealing the storage location,\n- Removing the injection facilities.\n\nThe above obligations must be fulfilled based on a **post-operation plan**, which should be:\n1. **Prepared by the operator** following best practices and **Appendix II of these Regulations**.\n2. **Initially submitted as a preliminary post-operation plan** to the **Ministry or an authorized entity** for approval, as required by **Section 4-6(p)**.\n3. **Updated, if necessary**, based on risk analysis, best practices, and technological improvements before shutdown.\n4. **Resubmitted and approved as the final post-operation plan** before final shutdown approval.\n\n**Regulations relating to exploitation of subsea reservoirs on the continental shelf for storage of CO2 and relating to transportation of CO2 on the continental shelf**\n\nThe regulations provide rules for:\n- Surveying and exploration of subsea reservoirs for CO2 storage,\n- Exploitation, transportation, and storage of CO2 in reservoirs under Norwegian jurisdiction.",
                "year": 2014,
                "jurisdiction": "National",
                "status": "In force",
                "link": "https://www.sodir.no/en/regulations/regulations/exploitation-of-subsea-reservoirs-on-the-continental-shelf-for-storage-of-and-transportation-of-co/",
                "action_point": "Prepare, submit, and update a post-operation plan for approval, ensuring compliance with monitoring, reporting, corrective measures, sealing, and removal obligations until the storage location responsibility is transferred to the State.",
                "summary": "- Ensure shutdown conditions in the storage license and consent for injection and storage are fulfilled as per Chapter 35 of Regulation No. 931 of 1 June 2004.\n- Obtain consent for shutdown from the King based on the operator's application.\n- Maintain responsibility for monitoring, reporting, corrective measures, sealing, and facility removal until the State assumes responsibility.\n- Prepare a post-operation plan following best practices and Appendix II of the regulations.\n- Submit a preliminary post-operation plan to the Ministry or authorized entity for approval as per Section 4-6(p).\n- Update the post-operation plan based on risk analysis, best practices, and technological advancements before shutdown.\n- Resubmit and obtain approval for the final post-operation plan before the final shutdown."
            }
        ]
    },
    {
        "region": "Queensland (Australia)",
        "issues": [
            {
                "issue": "Permitting and authorisation",
                "regulation": "Greenhouse Gas Storage Act 2010",
                "text": "",
                "action_point": "Obtain the necessary permits and authorizations as required by the Greenhouse Gas Storage Act 2010 before commencing any carbon storage activities.",
                "summary": "- Review the Greenhouse Gas Storage Act 2010 to understand the specific permitting and authorization requirements for CCS projects.\n- Ensure familiarity with the criteria for obtaining each Certificate of Conformity: Site Feasibility, Site Storage, Site Development, Site Operation, and Site Closure.\n- Compare the permitting timelines and processes outlined in the Greenhouse Gas Storage Act 2010 with those of other countries to identify any differences in regulatory efficiency.\n- Analyze the specific conditions and obligations imposed on CCS operators under the Greenhouse Gas Storage Act 2010 to ensure compliance.\n- Evaluate the legal framework for monitoring, reporting, and verification of stored greenhouse gases as stipulated in the Act.\n- Identify any unique regulatory requirements or challenges presented by the Greenhouse Gas Storage Act 2010 that may impact international CCS project comparisons.\n- Ensure that all comparisons are based on documented regulatory texts and avoid assumptions not supported by the Act.",
                "link": ""
            }
        ]
    },
    {
        "region": "Saskatchewan (Canada)",
        "issues": []
    },
    {
        "region": "South Australia (Australia)",
        "issues": [
            {
                "issue": "Measurement, monitoring and verification plans",
                "regulation": "Petroleum and Geothermal Energy Regulations 2013",
                "text": "Part 7 - Reports and information. Division 1 - Incident reports\n\n(1) For the purposes of section 85 of the Act, the following are classified as reportable incidents:\n(a) an escape of petroleum, a processed substance, a chemical or a fuel that affects an area that has not been specifically designed to contain such an escape;\n(b) an incident identified as a reportable incident under the relevant statement of environmental objectives.\n\nDivision 1 of Part 7 specifies the conditions of the report of incidents to the Minister.\n\nPart 7 - Reports and information. Division 2 - Performance and technical reports\n\n(1) A licensee must, within 2 months after the end of each licence year, furnish to the Minister a report for the relevant licence year (an annual report).\n\n(2) An annual report must be provided in a manner and form determined by the Minister.\n\n(3) An annual report must include—\n(a) a summary of the regulated activities conducted under the licence during the year; and\n(b) a report for the year on compliance with the Act, these regulations, the licence and any relevant statement of environmental objectives; and\n(c) a statement concerning any action to rectify non-compliance with obligations imposed by the Act, these regulations or the licence, and to minimise the likelihood of the recurrence of any such non-compliance; and\n(d) a summary of any management system audits undertaken during the relevant licence year, including information on any failure or deficiency identified by the audit and any corrective action that has, or will be, taken; and\n(e) a list of—\n(i) unless subparagraph (ii) applies—all reports and data relevant to the operation of the Act generated by the licensee during the relevant licensing year; or\n(ii) with the approval of the Minister—the technical reports required to be provided to the Minister under regulation 47 during the relevant licensing year; and\n(f) in relation to any incidents reported to the Minister under the Act and these regulations during the relevant licensing year—\n(i) an overall assessment and analysis of the incidents, including the identification and analysis of any trends that have emerged; and\n(ii) an overall assessment of the effectiveness of any action taken to rectify non-compliance with obligations imposed by the Act, these regulations or the licence, or to minimise the risk of recurrence of any such non-compliance; and\n(g) a report on any reasonably foreseeable threats (other than threats previously reported on) that reasonably present, or may present, a hazard to facilities or activities under the licence, and a report on any corrective action that has, or will be, taken; and\n(h) unless the relevant licence year is the last year in which the licence is to remain in force—a statement outlining operations proposed for the ensuing year; and\n(i) in the case of a petroleum production licence or a gas storage production licence—an estimate of the volume of petroleum likely to be produced, wasted, stored or sold under the licence during the ensuing year, or such longer period as the Minister may require; and\n(j) in the case of a production licence—an assessment of the development activities proposed to be undertaken under the licence, including the number of completions that are expected to occur, during the ensuing year, or such longer period as the Minister may require; and\n(k) in the case of a pipeline licence—the volume of any regulated substance transported through the pipeline during the relevant licence year.\n\nThe Petroleum and Geothermal Energy Act 2000\n\nThe main features of the Petroleum and Geothermal Energy Act 2000 are:\n\n- Establishment of a co-regulatory regime focused on achieving environmental, public safety and resource management objectives, and reduced compliance costs\n- Licence allocation and management mechanisms to facilitate competition in line with competition policy principles\n- Rights of third party access to licenced pipelines (where not covered by the national access regime), to depleted reservoirs (for gas storage purposes), and to pipeline easements\n- Greater security of tenure for licences through improved registration procedures\n- Public consultation processes with regard to establishment of environmental objectives and for significant proposed activities (consistent with provisions of the Planning, Development and Infrastructure Act 2016)\n- Reduced risk to government for liabilities arising from the activities of the industry\n- A fee structure designed to encourage the industry to adopt management systems to undertake activities\n- Inclusion of an effective and expeditious regulatory and approvals framework applicable to geothermal and gas storage activities.\n\nThe Petroleum and Geothermal Energy Regulations 2013 provides additional rules in addition to the Petroleum and Geothermal Energy Act 2000. Such rules include licence applications, environment protection, operator classification and activity notification, notice of entry on land, operational issues, reports and information.",
                "year": 2000,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Submit an annual report to the Minister within 2 months after the end of each licence year, including summaries of activities, compliance, audits, incidents, threats, and proposed operations.",
                "summary": "- Ensure all reportable incidents, such as escapes of petroleum or chemicals, are promptly reported to the Minister as per Part 7, Division 1 of the Petroleum and Geothermal Energy Regulations 2013.\n- Submit an annual report within two months after each licence year ends, detailing regulated activities, compliance status, and corrective actions taken, as required by Part 7, Division 2.\n- Include in the annual report a summary of management system audits, identifying any deficiencies and corrective actions, to comply with regulatory requirements.\n- Provide a comprehensive assessment of incidents, trends, and effectiveness of corrective actions in the annual report to meet the obligations under the regulations.\n- Report any foreseeable threats to facilities or activities and outline corrective actions in the annual report to ensure compliance with safety and environmental standards.\n- Outline proposed operations for the ensuing year in the annual report, unless it is the last year of the licence, to maintain transparency and regulatory compliance.\n- For production licences, include estimates of petroleum volumes and assessments of development activities in the annual report to fulfill regulatory obligations.\n- For pipeline licences, report the volume of substances transported during the licence year in the annual report to adhere to reporting requirements.\n- Understand the co-regulatory regime established by the Petroleum and Geothermal Energy Act 2000, focusing on environmental, safety, and resource management objectives.\n- Recognize the rights of third-party access to pipelines and depleted reservoirs as outlined in the Act to ensure compliance with access regulations.\n- Engage in public consultation processes for environmental objectives and significant activities as mandated by the Act to align with public interest and regulatory standards.\n- Be aware of the fee structure designed to encourage the adoption of management systems, as specified in the Act, to promote industry best practices.\n- Familiarize yourself with the additional rules provided by the Petroleum and Geothermal Energy Regulations 2013, including licence applications and operational issues, to ensure comprehensive compliance.",
                "link": ""
            },
            {
                "issue": "Operational liabilities and financial security",
                "regulation": "Petroleum and Geothermal Energy Act 2000",
                "text": "Division 10 - General requirements for operations. 86A - Fitness-for-purpose assessment\n\n(1) In this section—\nprescribed licence means—\n(a) a retention licence; or\n(b) a production licence; or\n(c) a pipeline licence; or\n(d) an associated activities licence; or\n(e) a special facilities licence.\n\n(2) A licensee under a prescribed licence must carry out fitness-for-purpose assessments of facilities operated on land within the area of the licence at intervals prescribed by the regulations in order to assess risks imposed by the facilities on—\n(a) public health and safety; and\n(b) the environment; and\n(c) the security of production or supply of natural gas (so far as this may be relevant).\n\n(3) An assessment under this section must comply with any requirements prescribed by the regulations.\n\n(4) The licensee must prepare a report on the assessment in a manner and form determined by the Minister and furnish a copy of the report to the Minister in accordance with the regulations.\n\n(5) A report under this section must comply with any other requirements prescribed by the regulations.\n\n(6) A licensee must promptly carry out any remedial action that is necessary or appropriate in view of a report under this section (and, in particular, must ensure that any identified risks are eliminated or reduced so far as is reasonably practicable).\n\n(7) A licensee who fails to comply with a requirement under this section is guilty of an offence. Maximum penalty: $120 000.\n\nThe Petroleum and Geothermal Energy Act 2000\n\nThe main features of the Petroleum and Geothermal Energy Act 2000 are:\n- Establishment of a co-regulatory regime focused on achieving environmental, public safety and resource management objectives, and reduced compliance costs\n- Licence allocation and management mechanisms to facilitate competition in line with competition policy principles\n- Rights of third party access to licenced pipelines (where not covered by the national access regime), to depleted reservoirs (for gas storage purposes), and to pipeline easements\n- Greater security of tenure for licences through improved registration procedures\n- Public consultation processes with regard to establishment of environmental objectives and for significant proposed activities (consistent with provisions of the Planning, Development and Infrastructure Act 2016)\n- Reduced risk to government for liabilities arising from the activities of the industry\n- A fee structure designed to encourage the industry to adopt management systems to undertake activities\n- Inclusion of an effective and expeditious regulatory and approvals framework applicable to geothermal and gas storage activities.\n\nThe Petroleum and Geothermal Energy Regulations 2013 provides additional rules in addition to the Petroleum and Geothermal Energy Act 2000. Such rules include licence applications, environment protection, operator classification and activity notification, notice of entry on land, operational issues, reports and information.",
                "year": 2000,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Conduct regular fitness-for-purpose assessments of facilities, prepare and submit reports to the Minister, and promptly address any identified risks.",
                "summary": "- Conduct fitness-for-purpose assessments regularly for facilities under prescribed licences to evaluate risks to public health, safety, the environment, and natural gas supply security, as mandated by Division 10, Section 86A of the Petroleum and Geothermal Energy Act 2000.\n- Ensure assessments comply with regulatory requirements and prepare reports in the format determined by the Minister, as required by subsections (3) and (4).\n- Submit assessment reports to the Minister and adhere to any additional regulatory requirements for reporting, as specified in subsections (4) and (5).\n- Implement necessary remedial actions promptly to mitigate identified risks, ensuring risks are eliminated or reduced as far as reasonably practicable, in compliance with subsection (6).\n- Avoid non-compliance with these requirements to prevent incurring a maximum penalty of $120,000, as stated in subsection (7).\n- Leverage the co-regulatory regime established by the Act to achieve environmental, public safety, and resource management objectives while minimizing compliance costs.\n- Utilize the Act's provisions for licence allocation and management to facilitate competition and ensure greater security of tenure through improved registration procedures.\n- Engage in public consultation processes for environmental objectives and significant activities, aligning with the Planning, Development and Infrastructure Act 2016.\n- Recognize the reduced government liability for industry activities and the fee structure designed to promote effective management systems.\n- Follow the Petroleum and Geothermal Energy Regulations 2013 for additional rules on licence applications, environmental protection, operator classification, and operational issues.",
                "link": ""
            }
        ]
    },
    {
        "region": "Texas (United States)",
        "issues": [
            {
                "issue": "Long-term liability post-site closure",
                "regulation": "HB 1796",
                "text": "Ownership of stored carbon dioxide is transferred to the state under the following conditions:\n\n1. The board determines that permanent storage has been verified.\n2. The storage site has met all applicable state and federal requirements for closure.\n3. Once acquired, the stored carbon dioxide becomes the property of the permanent school fund and is administered by the board.\n\nLiability Provisions:\n- The transfer of title does not relieve producers of liability for any acts or omissions related to carbon dioxide generation before it was stored.\n- On the date the state acquires title to the stored carbon dioxide, the producer is relieved of liability for any acts or omissions regarding the CO2 in the repository.\n- Liability remains with any entity contracting with the board for the construction or operation of the carbon dioxide repository.\n\nThe bill authorizes the Texas Natural Resource Conservation Commission to construct and operate an offshore CO2 geologic storage site, covering aspects such as permitting authority and long-term liability.",
                "year": 2009,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Verify permanent storage, ensure compliance with all closure requirements, and transfer ownership of stored CO2 to the state to relieve liability.",
                "summary": "- Verify that permanent storage of carbon dioxide is confirmed before transferring ownership to the state.\n- Ensure the storage site complies with all state and federal closure requirements.\n- Recognize that once the state acquires the stored CO2, it becomes part of the permanent school fund, managed by the board.\n- Note that producers remain liable for any actions related to CO2 generation prior to storage.\n- Understand that producers are relieved of liability for stored CO2 once the state assumes ownership.\n- Acknowledge that liability persists for entities contracted for construction or operation of the CO2 repository.\n- Be aware that the Texas Natural Resource Conservation Commission is authorized to manage offshore CO2 storage, including permitting and long-term liability aspects.",
                "link": ""
            },
            {
                "issue": "Permitting and authorisation",
                "regulation": "Texas Natural Resources Code",
                "text": "The Texas Natural Resources Code establishes permitting and regulatory requirements for pipelines, defining common carriers and their obligations.\n\nSec. 111.002: Common Carriers Under Chapter\nA person is considered a common carrier and subject to this chapter’s provisions if they:\n1. Own, operate, or manage a pipeline for transporting crude petroleum in Texas for public hire.\n2. Own, operate, or manage a crude petroleum pipeline in Texas constructed or maintained on, over, or under a public road or highway, or have the right of eminent domain.\n3. Own, operate, or manage a crude petroleum pipeline crossing or running along railroad rights-of-way or other common carrier infrastructure.\n4. Transport crude petroleum from an oil field or place of production to a distribution, refining, marketing center, or reshipping point within Texas.\n5. Own, operate, or manage pipelines transporting coal or coal mixtures for hire.\n6. Own, operate, or manage pipelines for the transportation of carbon dioxide or hydrogen for public hire, provided they file a written acceptance with the commission agreeing to be subject to this chapter’s duties and obligations as a common carrier.\n7. Own, operate, or manage pipelines for transporting feedstock for carbon gasification, carbon gasification products, or derivative products, provided they file a written acceptance with the commission agreeing to be a common carrier.\n\nThe Texas Natural Resources Code outlines the regulatory framework for CO2 transportation infrastructure, requiring pipeline operators to meet common carrier obligations and adhere to permitting requirements when constructing and operating pipelines within Texas.",
                "year": null,
                "jurisdiction": null,
                "status": null,
                "action_point": "File a written acceptance with the commission to agree to common carrier duties and obligations if operating pipelines for transporting carbon dioxide, hydrogen, or carbon gasification products for public hire.",
                "summary": "- Identify if a pipeline operator qualifies as a common carrier under the Texas Natural Resources Code by checking if they own, operate, or manage pipelines for crude petroleum, coal, carbon dioxide, hydrogen, or carbon gasification products for public hire.\n- Verify if the pipeline is constructed or maintained on, over, or under public roads, highways, or railroad rights-of-way, as this determines common carrier status.\n- Ensure pipeline operators transporting carbon dioxide or hydrogen file a written acceptance with the commission to be subject to common carrier duties and obligations.\n- Confirm that pipeline operators transporting feedstock for carbon gasification or its products also file a written acceptance to adhere to common carrier regulations.\n- Review the permitting requirements for constructing and operating pipelines within Texas to ensure compliance with the Texas Natural Resources Code.",
                "link": ""
            },
            {
                "issue": "Operational liabilities and financial security",
                "regulation": "Texas Administrative Code, Title 16: Economic Regulation, Part 1: Texas Railroad Commission, Chapter 5: Carbon Dioxide",
                "text": "Holders of CO2 storage facility permits are required to provide evidence demonstrating the permit holder’s financial responsibility and resources for:\n1. corrective action;\n2. injection well plugging;\n3. post-injection storage facility care and storage facility closure; and\n4. emergency and remedial responses, each year until the facility has reached the end of the post-injection storage facility care period.\n\nStorage facilities must not receive CO2 until the operator has obtained a bond or letter of credit for the facility in an amount equal to or greater than the maximum amount estimated to perform corrective action, emergency response, and remedial action, post-injection monitoring and site care, and closure of the geologic storage facility, and this financial security has been approved by the Director of the Oil and Gas Division of the Texas Railroad Commission. Operators must also notify the Commission of, among other things, any adverse financial conditions that may affect an operator's ability to carry out injection well plugging and post-injection storage facility care and closure.\n\nAn Act relating to the implementation of projects involving the capture, injection, sequestration, or geologic storage of carbon dioxide (SB 1387)\n\nThis bill instructs the Texas Railroad Commission to write regulations for CO2 geologic storage and clarifies regulatory issues such as CO2 ownership and property rights. This bill also creates a CO2 storage trust fund to cover the costs associated with long-term monitoring of storage facilities.",
                "year": 2009,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "link": "https://capitol.texas.gov/tlodocs/81r/billtext/html/sb01387f.htm",
                "action_point": "Obtain and maintain approved financial security in the form of a bond or letter of credit for CO2 storage facilities, covering all operational liabilities, and notify the Commission of any adverse financial conditions.",
                "summary": "- Ensure permit holders demonstrate financial responsibility for corrective actions, injection well plugging, post-injection care, and emergency responses annually until post-injection care ends.\n- Verify that storage facilities do not receive CO2 without a bond or letter of credit covering maximum estimated costs for corrective actions, emergency responses, post-injection monitoring, site care, and closure, approved by the Texas Railroad Commission's Oil and Gas Division Director.\n- Require operators to notify the Commission of any adverse financial conditions impacting their ability to perform injection well plugging and post-injection care and closure.\n- Implement regulations for CO2 geologic storage, addressing CO2 ownership and property rights, as instructed by SB 1387.\n- Utilize the CO2 storage trust fund for long-term monitoring costs of storage facilities."
            }
        ]
    },
    {
        "region": "United Kingdom",
        "issues": [
            {
                "issue": "Long-term liability post-site closure",
                "regulation": "The Storage of Carbon Dioxide (Termination of Licences) Regulations 2011",
                "text": "The termination of a storage site licence requires compliance with key regulatory conditions:\n\nRegulation 7: Minimum Period\n1. When a post-closure plan for a storage site is approved, the authority must determine a minimum period before licence termination.\n2. The minimum period must be at least 20 years from the closure date unless the authority determines that conditions allow for an earlier termination.\n3. If an early termination is considered, the authority must notify the licence holder.\n\nRegulation 8: Transfer Conditions\nFor a storage site transfer, the following conditions must be met:\n- All available evidence indicates that the stored CO2 will be completely and permanently contained.\n- The minimum period determined under Regulation 7 has elapsed.\n- The operator has provided the required financial contribution.\n- The storage site has been sealed, and injection facilities have been removed.\n- The abandonment programme has been carried out in accordance with Part 4 of the Petroleum Act 1998.\n\nRegulation 10: Financial Obligations\n1. Before termination, the authority determines the financial contribution required from the operator to cover expected post-transfer costs.\n2. The determination considers factors outlined in Article 20(1) of the Directive and any representations from the operator.\n3. The operator is notified of the required financial contribution and given at least 28 days to respond.\n4. The final financial contribution amount and due date are communicated to the operator, who must provide the payment to the appropriate Minister.\n\nThe Energy Act 2008\nThe UK Energy Act establishes a regulatory framework for offshore CO2 sequestration in UK territorial waters. The Act outlines the licensing, site operation, closure, liability transfer, and financial contribution requirements for long-term CO2 storage stewardship.",
                "year": 2008,
                "jurisdiction": "National",
                "status": "In force",
                "action_point": "Ensure compliance with minimum period, transfer conditions, and financial obligations before terminating a storage site licence.",
                "summary": "- Ensure compliance with the Storage of Carbon Dioxide (Termination of Licences) Regulations 2011 for licence termination.\n- Determine a minimum period of at least 20 years post-closure before licence termination, unless conditions justify earlier termination (Regulation 7).\n- Verify that all evidence supports the complete and permanent containment of CO2 for site transfer (Regulation 8).\n- Confirm that the minimum period has elapsed, financial contributions are made, and the site is sealed with injection facilities removed (Regulation 8).\n- Execute the abandonment programme as per Part 4 of the Petroleum Act 1998 (Regulation 8).\n- Assess and determine the financial contribution required from the operator for post-transfer costs, considering Article 20(1) of the Directive (Regulation 10).\n- Notify the operator of the financial contribution, allowing at least 28 days for response, and communicate the final amount and due date (Regulation 10).\n- Follow the UK Energy Act 2008 for regulatory compliance in offshore CO2 sequestration, covering licensing, operation, closure, liability transfer, and financial contributions.",
                "link": ""
            },
            {
                "issue": "Environmental impact assessments",
                "regulation": "The Storage of Carbon Dioxide (Licensing etc.) Regulations 2010",
                "text": "Regulation 7: Grant of storage permits\n\n(1) Before granting a storage permit the authority must be satisfied that—\n(a) the storage complex and surrounding area have been sufficiently characterised and assessed in accordance with the criteria set out in Annex I to the Directive,\n(b) no part of the storage complex extends beyond the territories of the member States,\n(c) under the proposed conditions of use of the storage site, there is no significant risk of leakage or of harm to the environment or human health, and\n(d) the conditions in paragraph (3) are met.\n\nRegulation 15 amends the Environmental Damage Regulations to include the operation of storage sites pursuant to the CCS Directive as an activity for which there is liability under the Environmental Damage Regulations.\n\nThe Energy Act 2008\n\nThe UK Energy Act establishes a high-level framework for the regulation of offshore CO2 sequestration activities (activities in the United Kingdom territorial sea and other specifically designated waters). In this context, the Act provides for much of the detail of this framework to be elaborated in regulations made under the Act (see associated instruments). For this purpose, the UK Energy Act includes guidance on the key issues to be addressed in such regulations, including for the purposes of licensing, site operation and closure, any transfer of liability, and financial contributions to long term stewardship.",
                "year": 2008,
                "jurisdiction": "National",
                "status": "In force",
                "action_point": "Ensure the storage complex is characterized and assessed, confirm no cross-border extension, verify no significant risk of leakage or harm, and comply with additional conditions before granting a storage permit.",
                "summary": "- Ensure storage complex and surrounding area are characterized and assessed per Annex I criteria of the Directive.\n- Confirm no part of the storage complex extends beyond member States' territories.\n- Verify proposed storage site conditions pose no significant risk of leakage or harm to environment or human health.\n- Comply with conditions outlined in Regulation 7(3) before granting storage permits.\n- Recognize operation of storage sites as liable under Environmental Damage Regulations per Regulation 15.\n- Follow UK Energy Act framework for offshore CO2 sequestration, including licensing, site operation, closure, liability transfer, and financial contributions for long-term stewardship.",
                "link": ""
            },
            {
                "issue": "Public engagement and consultation",
                "regulation": "UK Energy Act of 2008",
                "text": "Section 29: Requirement for public register\n\n(1) The Secretary of State must maintain a register containing prescribed information relating to licences.\n\n(2) Information is not to be included in the register if—\n(a) the Secretary of State thinks that disclosure of the information would be contrary to the interests of national security, or\n(b) the licensing authority thinks that disclosure of the information would prejudice to an unreasonable degree a person's commercial interests.\n\n(3) Information excluded from the register by virtue of subsection (2)(b) is treated, subject to subsection (4), as ceasing to prejudice a person's commercial interests at the end of the period of 4 years beginning with the date on which the licensing authority made the decision to exclude it.\n\n(4) The licensing authority may, on the application of the person whose commercial interests are affected, decide whether the information should be included in the register at the end of the period mentioned in subsection (3) or should continue to be excluded.\n\n(5) Where information of any description is excluded from the register by virtue of subsection (2)(b), a statement is to be included in the register indicating the existence of information of that description.\n\n(6) The Secretary of State must—\n(a) secure that the register maintained under this section is available for inspection by the public free of charge, and\n(b) afford to members of the public facilities for obtaining copies of entries, on payment of a fee.\n\n(7) In this section “prescribed” means prescribed by regulations made by the Secretary of State.\n\n[F74(8) The OGA must provide to the Secretary of State any information held by it that is required by the Secretary of State in order to comply with the requirements imposed by this section.]\n\nThe Energy Act 2008\n\nThe UK Energy Act establishes a high-level framework for the regulation of offshore CO2 sequestration activities (activities in the United Kingdom territorial sea and other specifically designated waters). In this context, the Act provides for much of the detail of this framework to be elaborated in regulations made under the Act (see associated instruments). For this purpose, the UK Energy Act includes guidance on the key issues to be addressed in such regulations, including for the purposes of licensing, site operation and closure, any transfer of liability, and financial contributions to long term stewardship.",
                "year": 2008,
                "jurisdiction": "National",
                "status": "In force",
                "action_point": "Maintain a public register of prescribed licensing information, ensuring public access and the ability to obtain copies, while excluding information that compromises national security or commercial interests.",
                "summary": "- Maintain a public register with prescribed information on licences as mandated by the Secretary of State.\n- Exclude information from the register if it compromises national security or unreasonably prejudices commercial interests.\n- Recognize that commercial interest exclusions expire after four years unless an extension is justified by the affected party.\n- Include a statement in the register indicating the existence of excluded information.\n- Ensure public access to the register free of charge and provide facilities for obtaining copies for a fee.\n- Understand that \"prescribed\" information is defined by regulations set by the Secretary of State.\n- Require the OGA to supply necessary information to the Secretary of State to fulfill register obligations.\n- Note that the UK Energy Act 2008 provides a framework for offshore CO2 sequestration regulation, including licensing, site operation, closure, liability transfer, and financial stewardship.",
                "link": ""
            }
        ]
    },
    {
        "region": "United States",
        "issues": [
            {
                "issue": "Measurement, monitoring and verification plans",
                "regulation": "Subpart RR - Geologic Sequestration of Carbon Dioxide",
                "text": "Section 98.442: GHGs to report\n\nYou must report:\n(a) Mass of CO2 received.\n(b) Mass of CO2 injected into the subsurface.\n(c) Mass of CO2 produced.\n(d) Mass of CO2 emitted by surface leakage.\n(e) Mass of CO2 emissions from equipment leaks and vented emissions of CO2 from surface equipment located between the injection flow meter and the injection wellhead.\n(f) Mass of CO2 emissions from equipment leaks and vented emissions of CO2 from surface equipment located between the production flow meter and the production wellhead.\n(g) Mass of CO2 sequestered in subsurface geologic formations.\n(h) Cumulative mass of CO2 reported as sequestered in subsurface geologic formations in all years since the facility became subject to reporting requirements under this subpart.\n\nSection 98.448: Geologic sequestration monitoring, reporting, and verification (MRV) plan\n\n(a) Contents of MRV plan. You must develop and submit to the Administrator a proposed MRV plan for monitoring, reporting, and verification of geologic sequestration at your facility. Your proposed MRV plan must contain the following components:\n(1) Delineation of the maximum monitoring area and the active monitoring areas. The first period for your active monitoring area will begin from the date determined in your MRV plan through the date at which the plan calls for the first expansion of the monitoring area. The length of each monitoring period can be any time interval chosen by you that is greater than 1 year.\n(2) Identification of potential surface leakage pathways for CO2 in the maximum monitoring area and the likelihood, magnitude, and timing of surface leakage of CO2 through these pathways.\n(3) A strategy for detecting and quantifying any surface leakage of CO2.\n(4) A strategy for establishing the expected baselines for monitoring CO2 surface leakage.\n(5) A summary of the considerations you intend to use to calculate site-specific variables for the mass balance equation. This includes, but is not limited to, considerations for calculating CO2 emissions from equipment leaks and vented emissions of CO2 between the injection flow meter and injection well and/or the production flow meter and production well, and considerations for calculating CO2 in produced fluids.\n(6) If a well is permitted under the Underground Injection Control program, for each injection well, report the well identification number used for the Underground Injection Control permit and the Underground Injection Control permit class. If the well is not yet permitted, and you have applied for an Underground Injection Control permit, report the well identification numbers in the permit application. If an offshore well is not subject to the Safe Drinking Water Act, for each injection well, report any well identification number and any identification number used for the legal instrument authorizing geologic sequestration. If you are submitting your Underground Injection Control permit application as part of your proposed MRV plan, you must notify EPA when the permit has been approved. If you are an offshore facility not subject to the Safe Drinking Water Act, and are submitting your application for the legal instrument authorizing geologic sequestration as part of your proposed MRV plan, you must notify EPA when the legal instrument authorizing geologic sequestration has been approved.\n(7) Proposed date to begin collecting data for calculating total amount sequestered according to equation RR-11 or RR-12 of this subpart. This date must be after expected baselines as required by paragraph (a)(4) of this section are established and the leakage detection and quantification strategy as required by paragraph (a)(3) of this section is implemented in the initial AMA.\n\n(b) Timing. You must submit a proposed MRV plan to EPA according to the following schedule:\n(1) You must submit a proposed MRV plan to EPA by June 30, 2011 if you were issued a final Underground Injection Control permit authorizing the injection of CO2 into the subsurface on or before December 31, 2010. You will be allowed to request one extension of up to an additional 180 days in which to submit your proposed MRV plan.\n(2) You must submit a proposed MRV plan to EPA within 180 days of receiving a final Underground Injection Control permit authorizing the injection of CO2 into the subsurface. If your facility is an offshore facility not subject to the Safe Drinking Water Act, you must submit a proposed MRV plan to EPA within 180 days of receiving authorization to begin geologic sequestration of CO2. You will be allowed to request one extension of the submittal date of up to an additional 180 days.\n(3) If you are injecting a CO2 stream in subsurface geologic formations to enhance the recovery of oil or natural gas and you are not permitted as Class VI under the Underground Injection Control program, you may opt to submit an MRV plan at any time.\n(4) If EPA determines that your proposed MRV plan is incomplete, you must submit an updated MRV plan within 45 days of EPA notification, unless otherwise specified by EPA.\n\n(c) Final MRV plan. The Administrator will issue a final MRV plan within a reasonable period of time. The Administrator's final MRV plan is subject to the provisions of part 78 of this chapter. Once the MRV plan is final and no longer subject to administrative appeal under part 78 of this chapter, you must implement the plan starting on the day after the day on which the plan becomes final and is no longer subject to such appeal.\n\n(d) MRV plan revisions. You must revise and submit the MRV plan within 180 days to the Administrator for approval if any of the following in paragraphs (d)(1) through (d)(4) of this section applies. You must include the reason(s) for the revisions in your submittal.\n(1) A material change was made to monitoring and/or operational parameters that was not anticipated in the original MRV plan. Examples of material changes include but are not limited to: large changes in the volume of CO2 injected; the construction of new injection wells not identified in the MRV plan; failures of the monitoring system including monitoring system sensitivity, performance, location, or baseline; changes to surface land use that affects baseline or operational conditions; observed plume location that differs significantly from the predicted plume area used for developing the MRV plan; a change in the maximum monitoring area or active monitoring area; or a change in monitoring technology that would result in coverage or detection capability different from the MRV plan.\n(2) A change in the permit class of your Underground Injection Control permit.\n(3) If you are notified by EPA of substantive errors in your MRV plan or monitoring report.\n(4) You choose to revise your MRV plan for any other reason in any reporting year.\n\n(e) Revised MRV plan. The requirements of paragraph (c) of this section apply to any submission of a revised MRV plan. You must continue reporting under your currently approved plan while awaiting approval of a revised MRV plan.\n\n(f) Format. Each proposed MRV plan or revision and each annual report must be submitted electronically in a format specified by the Administrator.\n\n(g) Certificate of representation. You must submit a certificate of representation according to the provisions in § 98.4 at least 60 days before submission of your MRV plan, your research and development exemption request, your MRV plan submission extension request, or your initial annual report under this part, whichever is earlier.\n\nGreenhouse Gas Reporting Program (GHGRP)\n\nThe GHGRP requires reporting of greenhouse gas (GHG) data and other relevant information from large GHG emission sources, fuel and industrial gas suppliers, and CO2 injection sites in the United States. Approximately 8,000 facilities are required to report their emissions annually, and the reported data are made available to the public in October of each year.",
                "year": 2009,
                "jurisdiction": "National",
                "status": "In force",
                "action_point": "Submit a comprehensive MRV plan to the EPA, including all required components and revisions, within specified deadlines and formats, and ensure continuous reporting under the approved plan while awaiting any revisions.",
                "summary": "- Ensure accurate reporting of CO2 mass metrics, including received, injected, produced, emitted by surface leakage, and sequestered amounts, as per Section 98.442.\n- Develop and submit a comprehensive MRV plan to the EPA, detailing monitoring areas, leakage pathways, detection strategies, and baseline establishment, as outlined in Section 98.448(a).\n- Include well identification numbers and permit details for wells under the Underground Injection Control program in your MRV plan.\n- Submit the MRV plan by specified deadlines, with possible extensions, depending on permit issuance dates, as per Section 98.448(b).\n- Implement the final MRV plan immediately after it becomes final and is no longer subject to appeal, as stated in Section 98.448(c).\n- Revise the MRV plan within 180 days if there are material changes, permit class changes, or if notified of errors by the EPA, as required by Section 98.448(d).\n- Continue reporting under the current MRV plan while awaiting approval of any revisions, as per Section 98.448(e).\n- Submit all MRV plans and reports electronically in the format specified by the Administrator, as mandated by Section 98.448(f).\n- Provide a certificate of representation at least 60 days before submitting any MRV-related documents, as required by Section 98.448(g).\n- Adhere to the GHGRP requirements for annual GHG data reporting from large emission sources, ensuring public availability of data each October.",
                "link": ""
            },
            {
                "issue": "Operational liabilities and financial security",
                "regulation": "Class VI - Wells used for Geologic Sequestration of Carbon Dioxide",
                "text": "The final rule, at § 146.85(a)(1), identifies the following qualifying financial instruments for Class VI wells, all of which must be sufficient to address endangerment of USDWs. Standby trusts are not needed for options 1, 4, and 5.\n\n(1) Trust Funds: If using a trust fund, owners or operators are required to set aside funds with a third party trustee sufficient to cover estimated costs. During the financial responsibility demonstration, the owner or operator may be required to deposit the required amount of money into the trust prior to the start of injection or during the ‘paying period’ if authorized by the Director.\n\n(2) Surety Bond: Owners or operators may use a payment surety bond or a performance surety bond to guarantee that financial responsibility will be fulfilled. In case of operator default, a payment surety bond funds a standby trust fund in the amount equal to the face value of the bond and sufficient to cover estimated costs, and a performance surety bond guarantees performance of the specific activity or payment of an amount equivalent to the estimated costs into a standby trust fund.\n\n(3) Letter of Credit: A letter of credit is a credit document, issued by a financial institution, guaranteeing that a specific amount of money will be available to a designated party under certain conditions. In case of operator default, letters of credit fund standby trust funds in an amount sufficient to cover estimated costs.\n\n(4) Insurance: The owner or operator may obtain an insurance policy to cover the estimated costs of GS activities requiring financial responsibility. This insurance policy must be obtained from a third party to decrease the possibility of failure (i.e., non-captive insurer).\n\n(5) Self Insurance (i.e., Financial Test and Corporate Guarantee): Owners or operators may self insure through a financial test provided certain conditions are met. The owner or operator needs to pass a financial test to demonstrate profitability, with a margin sufficient to cover contingencies and unknown obligations, and stability. If the owner or operator meets corporate financial test criteria, this is an indication that the owner or operator can guarantee its ability to satisfy financial obligations based solely on the strength of the company’s financial condition. An owner or operator who is not able to meet corporate financial test criteria may arrange a corporate guarantee by demonstrating that its corporate parent meets the financial test requirements on its behalf. The parent’s demonstration that it meets the financial test requirement is insufficient if it has not also guaranteed to fulfil the obligations for the owner or operator.\n\n(6) Escrow Account: Owners or operators may deposit money to an escrow account to cover financial responsibility requirements. This account must segregate funds sufficient to cover estimated costs for GS financial responsibility from other accounts and uses.\n\n(7) Other instrument(s) satisfactory to the Director: In addition to these instruments, EPA anticipates that new instruments that may be tailored to meet GS needs may emerge, and may be determined appropriate for use by the Director for the purpose of financial responsibility demonstrations. The final rule specifies that the qualifying financial responsibility instrument must include protective conditions of coverage, including, but not limited to: Cancellation, renewal, and continuation provisions; specifications on when the provider becomes liable in case of cancellation if there is a failure to renew with a new qualifying financial instrument; and requirements for the provider to meet a minimum credit rating, minimum capitalization, and ability to pass the bond rating when applicable. This clarification was made in direct response to issues raised by commenters for numerous instruments, and also to make sure that there is no gap in coverage if a financial instrument fails.\n\nUnderground Injection Control Program\n\nThe Underground Injection Control program consists of six classes of injection wells. Each well class is based on the type and depth of the injection activity, and the potential for that injection activity to result in endangerment of an underground source of drinking water.\n\nClass I wells are used to inject hazardous and non-hazardous wastes into deep, isolated rock formations.\nClass II wells are used exclusively to inject fluids associated with oil and natural gas production.\nClass III wells are used to inject fluids to dissolve and extract minerals.\nClass IV wells are shallow wells used to inject hazardous or radioactive wastes into or above a geologic formation that contains a USDW.\nClass V wells are used to inject non-hazardous fluids underground. Most Class V wells are used to dispose of wastes into or above underground sources of drinking water.\nClass VI wells are wells used for injection of carbon dioxide (CO2) into underground subsurface rock formations for long-term storage, or geologic sequestration.\n\nUIC regulations mandate the consideration of a variety of measures to assure that injection activities will not endanger USDWs. The UIC program may be implemented by the United States Environmental Protection Agency (EPA) or by states, territories, or tribes with EPA-approved primary permitting and enforcement authority. Activities performed by the UIC program include maintaining well inventory, permitting injection wells, performing inspections, and ensuring compliance with permit requirements. When operators manage wells in a way that does not meet the applicable UIC requirements, the program alerts operators to issues and may assist operators in returning the wells to compliance or take enforcement action.",
                "year": 1980,
                "jurisdiction": "National",
                "status": "In force",
                "link": "https://www.epa.gov/uic",
                "action_point": "Ensure financial responsibility for Class VI wells by selecting and maintaining one or more qualifying financial instruments to cover estimated costs and prevent endangerment of underground sources of drinking water.",
                "summary": "- Ensure financial instruments for Class VI wells are sufficient to address endangerment of Underground Sources of Drinking Water (USDWs).\n- Utilize trust funds by setting aside funds with a third-party trustee to cover estimated costs; deposit required amounts before injection or during the paying period if authorized.\n- Consider using surety bonds (payment or performance) to guarantee financial responsibility; in case of default, ensure bonds fund a standby trust fund to cover costs.\n- Obtain letters of credit from financial institutions to guarantee availability of funds under specific conditions; ensure they fund standby trust funds if default occurs.\n- Acquire insurance policies from third-party insurers to cover estimated costs of geologic sequestration (GS) activities.\n- Use self-insurance by passing a financial test to demonstrate profitability and stability; if unable, arrange a corporate guarantee with a financially stable parent company.\n- Deposit funds into an escrow account to meet financial responsibility requirements; ensure funds are segregated and sufficient to cover estimated costs.\n- Explore other financial instruments satisfactory to the Director; ensure they include protective conditions like cancellation, renewal, and minimum credit rating requirements.\n- Understand that the Underground Injection Control (UIC) program oversees six classes of wells, with Class VI specifically for CO2 injection for long-term storage.\n- Recognize that UIC regulations aim to prevent endangerment of USDWs and may be implemented by the EPA or authorized states, territories, or tribes.\n- Maintain compliance with UIC requirements through well inventory, permitting, inspections, and adherence to permit conditions; address non-compliance promptly."
            },
            {
                "issue": "Storage resource assessment",
                "regulation": "Class VI - Wells used for Geologic Sequestration of Carbon Dioxide",
                "text": "**Site Characterization for Class VI Permitting**\n\nSite characterization for Class VI permitting focuses on demonstrating that a proposed project site has a suitable injection zone to receive the carbon dioxide and a confining zone that will prevent fluid movement out of the injection zone as described under **40 CFR 146.83**. Owners or operators must gather the data necessary to demonstrate site suitability and submit this with a Class VI permit application to be evaluated by the **UIC Program Director** prior to receiving authorization to construct the well (**40 CFR 146.82(a)**), and must update and gather more detailed site-specific information and submit this prior to receiving authorization for injection (**40 CFR 146.82(c)**).\n\nThe **site characterization process** typically includes a general characterization of regional and site geology, followed by detailed characterization of the injection zone and confining zones. The more general characterization includes data on the regional geology and hydrogeology, supported by maps, cross-sections, and other available data. The more detailed information focuses on the proposed project site and involves submission of data on **stratigraphy, structural geology, hydrogeology, geomechanical properties, and geochemistry**. The initial stage includes compiling pre-existing and/or new information, maps, cross-sections, geochemical and petrophysical data, and geophysical or remote sensing information as described under **40 CFR 146.82(a)**. Final site characterization data will be collected as the injection well is drilled, core samples are taken and analyzed, and logs and tests are performed, as described under **40 CFR 146.82(c)**.\n\n**Underground Injection Control Program**\n\nThe Underground Injection Control (UIC) program consists of six classes of injection wells. Each well class is based on the type and depth of the injection activity, and the potential for that injection activity to result in endangerment of an underground source of drinking water (USDW).\n\n- **Class I** wells are used to inject hazardous and non-hazardous wastes into deep, isolated rock formations.\n- **Class II** wells are used exclusively to inject fluids associated with oil and natural gas production.\n- **Class III** wells are used to inject fluids to dissolve and extract minerals.\n- **Class IV** wells are shallow wells used to inject hazardous or radioactive wastes into or above a geologic formation that contains a USDW.\n- **Class V** wells are used to inject non-hazardous fluids underground. Most Class V wells are used to dispose of wastes into or above underground sources of drinking water.\n- **Class VI** wells are used for the injection of carbon dioxide (CO2) into underground subsurface rock formations for long-term storage or geologic sequestration.\n\nUIC regulations mandate the consideration of a variety of measures to assure that injection activities will not endanger USDWs. The **UIC program may be implemented by the United States Environmental Protection Agency (EPA) or by states, territories, or tribes with EPA-approved primary permitting and enforcement authority**. Activities performed by the UIC program include maintaining well inventory, permitting injection wells, performing inspections, and ensuring compliance with permit requirements. When operators manage wells in a way that does not meet the applicable UIC requirements, the program alerts operators to issues and may assist operators in returning the wells to compliance or take enforcement action.",
                "year": 1980,
                "jurisdiction": "National",
                "status": "In force",
                "link": "https://www.epa.gov/uic/class-vi-wells-used-geologic-sequestration-co2",
                "action_point": "Gather and submit detailed site characterization data, including geology, hydrogeology, and geochemistry, with the Class VI permit application and update it before injection authorization.",
                "summary": "- Ensure the proposed project site has a suitable injection zone and a confining zone to prevent fluid movement, as per **40 CFR 146.83**.\n- Gather and submit necessary data for site suitability with a Class VI permit application to the **UIC Program Director** before well construction authorization, as required by **40 CFR 146.82(a)**.\n- Update and submit detailed site-specific information before receiving injection authorization, as mandated by **40 CFR 146.82(c)**.\n- Conduct a general characterization of regional and site geology, including data on regional geology and hydrogeology, supported by maps and cross-sections.\n- Provide detailed data on stratigraphy, structural geology, hydrogeology, geomechanical properties, and geochemistry for the proposed project site.\n- Compile pre-existing or new information, maps, cross-sections, geochemical and petrophysical data, and geophysical or remote sensing information as per **40 CFR 146.82(a)**.\n- Collect final site characterization data during well drilling, including core sample analysis, logs, and tests, in accordance with **40 CFR 146.82(c)**.\n- Recognize that Class VI wells are specifically for CO2 injection into subsurface rock formations for long-term storage.\n- Understand that the UIC program, potentially managed by the EPA or approved states, territories, or tribes, ensures injection activities do not endanger USDWs.\n- Maintain compliance with UIC regulations through well inventory, permitting, inspections, and adherence to permit requirements."
            }
        ]
    },
    {
        "region": "Victoria (Australia)",
        "issues": [
            {
                "issue": "Permitting and authorisation",
                "regulation": "Greenhouse Gas Storage Act 2010",
                "text": "The Greenhouse Gas Storage Act 2010 establishes the regulatory framework for permitting CO2 storage through exploration permits and injection and storage leases.\n\n**Granting of Injection and Storage Leases**\n1. Injection and storage leases may be granted in two ways:\n   - To an existing exploration permit holder, either solely or jointly with another applicant, if the exploration permit holder consents (Section 113).\n   - Through a competitive tender process in accordance with Part 3 of Chapter 3.\n2. Under Section 135, tenders may only be invited for land that:\n   - Is not already subject to an exploration permit or injection and storage lease.\n   - Is not otherwise unavailable or excluded.\n3. Exploration permit holders effectively have a preferential right to apply for an injection and storage lease over land covered by their permit, as other parties cannot apply for the same area.\n\n**Regulatory Purpose**\nThe Greenhouse Gas Storage Act 2009 states its main purpose in Section 3(1): “to help reduce the impact of greenhouse gas emissions on the environment.”\n- The Act regulates the granting of rights for exploration and geological CO2 storage.\n- It facilitates the safe geological storage of greenhouse gases.\n- Secondary purposes outlined in Section 3(4) support the responsible management of storage activities.\n\nThe Act provides a structured permitting and leasing framework to regulate CO2 storage activities in Queensland, ensuring environmental protection and responsible resource management.",
                "year": 2009,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Apply for an injection and storage lease through consent as an exploration permit holder or participate in a competitive tender for eligible land not under existing permits or leases.",
                "summary": "- Understand that the Greenhouse Gas Storage Act 2010 provides the regulatory framework for CO2 storage through exploration permits and injection and storage leases.\n- Recognize that injection and storage leases can be granted to existing exploration permit holders with consent or through a competitive tender process.\n- Note that tenders for injection and storage leases are only invited for land not already under an exploration permit or lease, and not otherwise unavailable or excluded.\n- Acknowledge that exploration permit holders have a preferential right to apply for an injection and storage lease over their permit area, preventing other parties from applying for the same land.\n- Be aware that the Act's main purpose is to reduce the impact of greenhouse gas emissions on the environment by regulating exploration and geological CO2 storage.\n- Ensure that the Act facilitates safe geological storage of greenhouse gases and supports responsible management of storage activities.\n- Recognize that the Act provides a structured permitting and leasing framework to ensure environmental protection and responsible resource management in Queensland.",
                "link": ""
            },
            {
                "issue": "Financial assurances of long-term site stewardship",
                "regulation": "Greenhouse Gas Geological Sequestration Act 2008",
                "text": "Part 5—Greenhouse gas substance injection and monitoring licence. Division 7—Conditions of greenhouse gas substance injection and monitoring licence. Section 112: Payment of long-term monitoring and verification costs\n\n(1) It is a condition of an injection and monitoring licence that the holder of the licence must pay an annual instalment of the estimated long-term monitoring and verification costs set out in the approved injection and monitoring plan.\n\n(2) The annual instalment amount is to be a percentage fixed by the Minister of the total estimated cost.\n\n(3) The licence holder must pay each instalment by the date that it is due to be paid.\n\nPart 9—Provisions applying to authorities generally. Division 5—Surrender or cancellation of authorities. Section 174: Payment of long-term monitoring and verification costs\n\n(1) If the Minister consents to the surrender of an injection and monitoring licence, the licence holder must, before surrendering the licence, pay the remaining cost of carrying out long-term monitoring and verification as detailed in the long-term monitoring and verification plan approved under section 170(2) and which has not already been paid in accordance with section 112.\n\n(2) If the licence holder has paid more than the cost estimated in the long-term monitoring and verification plan, the licence holder is entitled to a refund of the difference between the amount paid and the cost estimated in the approved plan.\n\nGreenhouse Gas Geological Sequestration Act 2008 (Victorian Onshore Act)\n\nThe purpose of the Victorian Onshore Act is stated in section 1 as being “to facilitate and regulate the injection of greenhouse gas substances into underground geological formations for the purpose of permanent storage of those gases, including to facilitate and regulate the exploration for suitable underground geological storage formations, as part of Victoria’s commitment to the reduction of atmospheric greenhouse gas emissions.” The objectives of the Act are outlined in Section 7.",
                "year": 2008,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Pay annual instalments of long-term monitoring and verification costs as specified in the approved plan, and settle any remaining costs before surrendering the licence.",
                "summary": "- Ensure licence holders pay annual instalments for long-term monitoring and verification costs as per the approved plan (Section 112(1)).\n- Confirm the annual instalment percentage is fixed by the Minister (Section 112(2)).\n- Verify instalments are paid by the due date (Section 112(3)).\n- Require payment of remaining long-term monitoring costs before licence surrender if consented by the Minister (Section 174(1)).\n- Provide refunds if payments exceed estimated costs in the approved plan (Section 174(2)).\n- Understand the Act's purpose to regulate greenhouse gas injection for permanent storage and exploration of geological formations (Section 1).",
                "link": ""
            },
            {
                "issue": "Measurement, monitoring and verification plans",
                "regulation": "Greenhouse Gas Geological Sequestration Act 2008",
                "text": "Part 2 - Ownership and control of the greenhouse gas substances and underground geological storage formations. Section 18: Offence to carry out greenhouse gas substance injection and monitoring unless authorised\n\nA person must not carry out any greenhouse gas substance injection and monitoring in Victoria except—\n(a) under, and in accordance with, an injection and monitoring licence; or\n(b) as otherwise permitted by this Act.\n\nPart 5 - Greenhouse gas substance injection and monitoring licence. Division 6 - Injection and monitoring plan. Section 93: Content of injection and monitoring plan\n\nAn injection and monitoring plan must include—\n(a) details of the activities that the licence holder intends to conduct and the proposed dates by which those activities are to be completed; and\n(b) details of physical, hydrological, geological, chemical and biological conditions of the land in the licence area for the purposes of developing a baseline for managing and monitoring any change to those conditions;\n(c) details of the nature of the greenhouse gas substance to be injected into the underground geological formation; and\n(d) a verifiable estimate of the storage capacity of the underground geological storage formation; and\n(e) a verifiable estimate of the rate and volume of greenhouse gas substance that is proposed to be injected; and\n(f) a description of the proposed injection and monitoring techniques; and\n(g) an assessment of the potential leakage and migration path of an injected greenhouse gas substance from the underground geological storage formation; and\n(h) an assessment of the effect any leakage of a greenhouse gas substance might have on public health, the environment and other resources; and\n(i) an assessment of the likelihood of leakage of a greenhouse gas substance, including leakage arising—\n    (i) during the injection and monitoring of a greenhouse gas substance; and\n    (ii) after the right to inject a greenhouse gas substance has been surrendered; and\n    (iii) after a greenhouse gas injection and monitoring licence has been surrendered; and\n(j) a monitoring and verification plan prepared in accordance with the regulations and detailing how the behaviour of any stored greenhouse gas substance will be monitored; and\n(k) a risk management plan prepared in accordance with the regulations; and\n(l) an estimate of the cost of carrying out the monitoring and verification activities after the greenhouse gas injection and monitoring licence has been surrendered; and\n(m) any other prescribed matters\n\nSection 95: Plan to be approved before injection and monitoring can start\n\nThe holder of an injection and monitoring licence must not carry out greenhouse gas substance injection and monitoring in the licence area unless the Minister has approved the holder's greenhouse gas substance injection and monitoring plan for the licence area.\n\nDivision 7—Conditions of greenhouse gas substance injection and monitoring licence. Section 111: Reporting\n\n(1) If the holder of an injection and monitoring licence has an approved injection and monitoring plan, it is a condition of the injection and monitoring licence that the holder of the licence provide to the Environment Protection Authority a report on the outcome of all monitoring and verification activities carried out under the licence.\n\n(2) A report under subsection (1) must be provided—\n    (a) at the times specified in the monitoring and verification plan; or\n    (b) if no times are specified in the monitoring and verification plan, every three months.\n\n(3) The Environment Protection Authority must give the Minister a copy of each report provided under this section.\n\n(4) The Minister must ensure that a copy of each report provided under this section is available for inspection on the greenhouse gas sequestration register.\n\nSection 112: Payment of long-term monitoring and verification costs\n\n(1) It is a condition of an injection and monitoring licence that the holder of the licence must pay an annual instalment of the estimated long-term monitoring and verification costs set out in the approved injection and monitoring plan.\n\n(2) The annual instalment amount is to be a percentage fixed by the Minister of the total estimated cost.\n\n(3) The licence holder must pay each instalment by the date that it is due to be paid.\n\nGreenhouse Gas Geological Sequestration Act 2008 (Victorian Onshore Act)\n\nThe purpose of the Victorian Onshore Act is stated in section 1 as being “to facilitate and regulate the injection of greenhouse gas substances into underground geological formations for the purpose of permanent storage of those gases, including to facilitate and regulate the exploration for suitable underground geological storage formations, as part of Victoria’s commitment to the reduction of atmospheric greenhouse gas emissions.” The objectives of the Act are outlined in Section 7.",
                "year": 2008,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Obtain an injection and monitoring licence, develop and get approval for an injection and monitoring plan, conduct activities as per the plan, report outcomes to the Environment Protection Authority, and pay annual instalments for long-term monitoring costs.",
                "summary": "- Ensure all greenhouse gas injection and monitoring activities in Victoria are conducted under an authorised licence as per Section 18.\n- Develop a comprehensive injection and monitoring plan that includes detailed activity timelines, baseline environmental conditions, and specifics of the greenhouse gas substance, as outlined in Section 93.\n- Include verifiable estimates of storage capacity, injection rates, and volumes in the plan.\n- Assess potential leakage paths, impacts on public health and the environment, and likelihood of leakage during and after operations.\n- Prepare a monitoring and verification plan and a risk management plan in accordance with regulations.\n- Obtain ministerial approval for the injection and monitoring plan before commencing operations, as required by Section 95.\n- Report monitoring and verification outcomes to the Environment Protection Authority at specified intervals, ensuring transparency and compliance with Section 111.\n- Pay annual instalments for long-term monitoring and verification costs as a condition of the licence, following Section 112.\n- Recognize the Act's purpose to facilitate and regulate greenhouse gas storage as part of Victoria's commitment to reducing emissions.",
                "link": ""
            },
            {
                "issue": "Environmental impact assessments",
                "regulation": "Greenhouse Gas Geological Sequestration Act 2008",
                "text": "Section 7 states that the Act seeks to establish a regulatory regime capable of ensuring that:\n1. the impacts of CO2 storage activities on human health and the environment are minimised;\n2. affected land is rehabilitated; and\n3. activities generally are conducted in accordance with principles of sustainable development enumerated in Section 8, such as the precautionary principle and the principles of inter- and intra-generational equity.\n\nTo this end, the Act includes a range of detailed provisions addressing environmental and health risks and impacts. Underpinning these provisions are the principles that:\n1. under Section 12, the Minister may declare that any land or class of land cannot be used for CO2 sequestration, in order to protect such land for significant environmental reasons, while under Section 192 sequestration activities on certain wilderness lands is prohibited;\n2. CO2 storage activities must not be undertaken where they present a risk to human health or the environment (see e.g. Sections 40 and 96);\n3. proposed activities must be subject to careful review by a range of stakeholders, including government energy and environment officials and the public, with revisions made where appropriate (see e.g. Sections 41, 52, 53, 97, 109, 136, 144 and 171);\n4. under Section 157, authorities for the undertaking of sequestration activities may be subject to conditions to ensure the protection of human health and/or the environment, and can be cancelled under Section 175 if there is a risk to health or the environment;\n5. under Section 217, land impacted by CO2 storage activities must be rehabilitated following the completion of injection operations (a rehabilitation bond must be provided under Section 222, to ensure performance of this obligation). If a primary authorisation that is the basis for a special drilling authorisation granted under Part 8A is cancelled, suspended or surrendered under this Act or the Offshore Petroleum and Greenhouse Gas Storage Act 2010, the special drilling authorisation that relates to that primary authorisation is taken to be cancelled on the same day the primary authorisation is cancelled, suspended or surrendered. Similarly, if a primary authorisation that is the basis for a special drilling authorisation granted under Part 8A expires or is terminated under this Act or the Offshore Petroleum and Greenhouse Gas Storage Act 2010, the special drilling authorisation that relates to that primary authorisation is taken to expire or be terminated on the same day the primary authorisation expires (S. 175A and S. 175B inserted by No. 68/2014);\n6. under Section 271, the Minister can issue a prohibition notice to stop sequestration activities where there is a risk of significant damage to the environment. The Environment Protection Authority may issue to the holder of the authority a prohibition notice. (S. 271A regarding inserted by No. 61/2008 s. 313)\n\nGreenhouse Gas Geological Sequestration Act 2008 (Victorian Onshore Act)\n\nThe purpose of the Victorian Onshore Act is stated in section 1 as being “to facilitate and regulate the injection of greenhouse gas substances into underground geological formations for the purpose of permanent storage of those gases, including to facilitate and regulate the exploration for suitable underground geological storage formations, as part of Victoria’s commitment to the reduction of atmospheric greenhouse gas emissions.” The objectives of the Act are outlined in Section 7.",
                "year": 2008,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Ensure CO2 storage activities minimize health and environmental impacts, rehabilitate affected land, adhere to sustainable development principles, and comply with stakeholder reviews and potential prohibitions.",
                "summary": "- Ensure CO2 storage activities minimize impacts on human health and the environment as per Section 7.\n- Rehabilitate affected land following CO2 storage activities, supported by Section 217.\n- Conduct activities in line with sustainable development principles, including precautionary and inter-generational equity principles, as outlined in Section 8.\n- Recognize that the Minister can declare land unsuitable for CO2 sequestration to protect the environment (Section 12) and prohibit activities on wilderness lands (Section 192).\n- Avoid CO2 storage activities that pose risks to human health or the environment, as mandated by Sections 40 and 96.\n- Subject proposed activities to stakeholder review, including government and public input, with potential revisions (Sections 41, 52, 53, 97, 109, 136, 144, and 171).\n- Comply with conditions for sequestration activities to protect health and the environment, with potential cancellation if risks arise (Sections 157 and 175).\n- Provide a rehabilitation bond to ensure land rehabilitation post-injection operations (Section 222).\n- Be aware that special drilling authorizations are contingent on the status of primary authorizations, as per Sections 175A and 175B.\n- Note that the Minister can issue prohibition notices to halt activities posing significant environmental risks (Section 271), with additional authority granted to the Environment Protection Authority (Section 271A).",
                "link": ""
            },
            {
                "issue": "Public engagement and consultation",
                "regulation": "Greenhouse Gas Geological Sequestration Act 2008",
                "text": "Section 7 states that the Act expressly seeks to establish a regulatory regime capable of ensuring effective public consultation and access to information regarding CO2 storage activities undertaken in Victoria.\n\nTo this end, Section 152 establishes a general obligation for authority holders (in this context, permit holders) to consult with communities and municipal councils throughout the period of the authority, both by sharing relevant information and providing opportunities to respond.\n\nUnder Section 153, applications for authorities not required to prepare an Environment Effects Statement under the Environment Effects Act 1978 must instead include a community consultation plan prepared within 90 days, or before carrying out an activity under the authority of the grant of the authority—whichever is the earlier in accordance with Section 154, which in turn must be approved by the Minister in accordance with Section 155 prior to issuance of any permit. Where the authority is granted, copies of the approved community consultation plan must be provided to the community in accordance with Section 156.\n\nCommunity consultation and conference requirements also apply:\n1. for proposed injection testing plans, under Sections 46 and 47; and\n2. for proposed injection and monitoring plans, under Sections 102 and 103.\n\nIn addition, Part 6 Division 1 of the Act requires the Minister to establish a publicly accessible greenhouse gas sequestration register, which sets out relevant information in relation to CO2 storage permits and activities.\n\nGreenhouse Gas Geological Sequestration Act 2008 (Victorian Onshore Act)\n\nThe purpose of the Victorian Onshore Act is stated in Section 1 as being “to facilitate and regulate the injection of greenhouse gas substances into underground geological formations for the purpose of permanent storage of those gases, including to facilitate and regulate the exploration for suitable underground geological storage formations, as part of Victoria’s commitment to the reduction of atmospheric greenhouse gas emissions.” The objectives of the Act are outlined in Section 7.",
                "year": 2008,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Prepare and submit a community consultation plan within 90 days or before any activity, ensure Ministerial approval, and provide the approved plan to the community.",
                "summary": "- Ensure effective public consultation and access to information regarding CO2 storage activities as mandated by Section 7 of the Greenhouse Gas Geological Sequestration Act 2008.\n- Obligate authority holders to consult with communities and municipal councils throughout the authority period, sharing relevant information and providing opportunities for community response (Section 152).\n- Require a community consultation plan for applications not needing an Environment Effects Statement, to be prepared within 90 days or before any activity, and approved by the Minister (Sections 153-155).\n- Distribute approved community consultation plans to the community as per Section 156.\n- Apply community consultation and conference requirements for proposed injection testing and monitoring plans (Sections 46, 47, 102, and 103).\n- Establish a publicly accessible greenhouse gas sequestration register to provide information on CO2 storage permits and activities (Part 6 Division 1).\n- Recognize the Act's purpose to facilitate and regulate the injection and exploration of greenhouse gas substances for permanent storage, supporting Victoria's commitment to reducing atmospheric greenhouse gas emissions (Section 1).",
                "link": ""
            },
            {
                "issue": "Operational liabilities and financial security",
                "regulation": "Greenhouse Gas Geological Sequestration Act 2008",
                "text": "Part 13—Other obligations on the holders of authorities\nDivision 1—Operation plan to be prepared. Section 209: Operation plan to be prepared\n\nBefore carrying out any greenhouse gas sequestration operation, the holder of the authority under which the operation is to be carried out must give the Minister an operation plan—\n(a) that identifies the risks that the operation may pose to the environment, to any member of the public, land or property in the vicinity of the operation; and\n(b) that specifies what the holder of the authority will do to eliminate or minimise those risks; and\n(c) that specifies what the holder of the authority will do to rehabilitate the land that will be affected by the operation; and\n(d) that sets out any other matters required by the regulations.\n\nSection 211: Plan must be observed in carrying out operation\n\nIn carrying out a greenhouse gas sequestration operation, the holder of an authority must ensure that the operation is carried out in accordance with the operation plan approved by the Minister in relation to the operation.\n\nDivision 2—Conduct of operations. Section 213: Operation to be conducted in proper manner\n\nThe holder of an authority must ensure that any greenhouse gas sequestration operation carried out in the authority area is carried out in a proper and workmanlike manner.\n\nSection 214: Other specific obligations concerning conduct of operations\n\nThe holder of an authority must, unless permitted to do otherwise under this Act, take all reasonable steps to—\n(a) control the flow and prevent the waste or escape in the authority area of the greenhouse gas substance or water; and\n(b) prevent the escape in the authority area of any mixture of water or drilling liquid with the greenhouse gas substance or any other matter; and\n(c) prevent greenhouse gas sequestration operations in the authority area from damaging underground geological storage formations in areas outside the authority area; and\n(d) keep separate each greenhouse gas substance injected in the authority area and any sources of water discovered in that area that the Minister directs the holder in writing to keep separate.\n\nSection 215: Maintenance etc. of property\n\n(1) The holder of an authority must maintain in good condition and repair all structures, equipment and other property in the authority area that is used in connection with the greenhouse gas sequestration operations being carried out under the authority. Penalty: 240 penalty units.\n\n(2) The holder of an authority must remove from the authority area all structures, equipment and other property that are not being used, or that are not to be used, in connection with the greenhouse gas sequestration operations being conducted under the authority. Penalty: 240 penalty units.\n\n(3) Subsections (1) and (2) do not apply in relation to any structure, equipment or other property that was not brought into the authority area by, or with the authority, of the authority holder.\n\nSection 217: Rehabilitation\n\n(1) The holder of an authority must rehabilitate any land that is used in carrying out any operation under the authority and must, as far as is practicable, complete the rehabilitation of the land before the authority, or any renewed authority, ceases to apply to the land.\n\n(2) It is sufficient compliance with this section in respect of an operation if the holder of an authority fully complies with the rehabilitation measures in the operation plan concerning that operation.\n\nSection 218: Insurance must be held\n\nThe holder of an authority must obtain and maintain, as directed by the Minister from time to time, insurance against expenses or liabilities or specified things arising in connection with, or as a result of, the carrying out of operations, or the doing of any other thing, under the authority, including the expenses of complying with directions with respect to the clean-up or other remedying of the effects of the escape of a greenhouse gas substance. Penalty: 240 penalty units.\n\nGreenhouse Gas Geological Sequestration Act 2008 (Victorian Onshore Act)\n\nThe purpose of the Victorian Onshore Act is stated in section 1 as being to facilitate and regulate the injection of greenhouse gas substances into underground geological formations for the purpose of permanent storage of those gases, including to facilitate and regulate the exploration for suitable underground geological storage formations, as part of Victoria’s commitment to the reduction of atmospheric greenhouse gas emissions. The objectives of the Act are outlined in Section 7.",
                "year": 2008,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "link": "https://www.legislation.vic.gov.au/in-force/acts/greenhouse-gas-geological-sequestration-act-2008/013",
                "action_point": "Prepare and submit an operation plan to the Minister, ensure operations comply with the approved plan, conduct operations properly, maintain and remove unused property, rehabilitate land, and maintain required insurance.",
                "summary": "- Ensure the preparation of an operation plan before any greenhouse gas sequestration operation. The plan must identify environmental risks, specify risk mitigation and land rehabilitation measures, and include any other regulatory requirements (Section 209).\n\n- Adhere strictly to the approved operation plan during the execution of sequestration operations (Section 211).\n\n- Conduct operations in a proper and workmanlike manner, ensuring control of greenhouse gas flow, preventing waste or escape, and avoiding damage to geological formations outside the authority area (Sections 213, 214).\n\n- Maintain all structures and equipment in good condition and remove unused items from the authority area. Non-compliance results in penalties (Section 215).\n\n- Complete land rehabilitation as per the operation plan before the authority ceases to apply. Compliance with the operation plan's rehabilitation measures is mandatory (Section 217).\n\n- Obtain and maintain insurance as directed by the Minister to cover liabilities and expenses related to operations, including clean-up of greenhouse gas escapes. Non-compliance results in penalties (Section 218).\n\n- Recognize that the Victorian Onshore Act aims to regulate the injection and storage of greenhouse gases to reduce atmospheric emissions, aligning with Victoria's environmental commitments."
            },
            {
                "issue": "Storage resource assessment",
                "regulation": "Greenhouse Gas Geological Sequestration Act 2008",
                "text": "**Part 3 - Greenhouse Gas Sequestration Exploration Permits**\n\n**Section 19: Rights conferred by exploration permit**\n\n1. An exploration permit authorises the holder of the permit, subject to and in accordance with the conditions of the permit—\n   (a) to carry out greenhouse gas sequestration exploration in the permit area; and\n   (b) to do anything in that area that is necessary for, or incidental to, that purpose.\n2. If the holder of an exploration permit discovers an underground geological storage formation in the permit area that is likely to be geologically suitable for the permanent storage of a greenhouse gas substance, the holder has the right to apply for the grant of—\n   (a) an injection and monitoring licence; or\n   (b) a greenhouse gas sequestration formation retention lease.\n\n**Section 21: Key objectives of work program**\n\n1. In addition to the requirements set out in Section 148, the key objectives of the work program applying to the holder of an exploration permit are—\n   (a) to establish the characteristics and the extent of any underground geological storage formation in the permit area; and\n   (b) to assess the feasibility of injecting a greenhouse gas substance into an underground geological storage formation; and\n   (c) to assess the suitability of an underground geological storage formation for the permanent storage of a greenhouse gas substance; and\n   (d) to ensure that greenhouse gas sequestration exploration is carried out in a manner that—\n      (i) protects the integrity of the underground geological storage formation; and\n      (ii) protects public health and the environment from the impact of greenhouse gas sequestration exploration.\n2. The holder of an exploration permit must ensure that the key objectives of the work program specified in subsection (1) are achieved to the maximum extent that is practicable.\n\n**Greenhouse Gas Geological Sequestration Act 2008 (Victorian Onshore Act)**\n\nThe purpose of the Victorian Onshore Act is stated in Section 1 as being “to facilitate and regulate the injection of greenhouse gas substances into underground geological formations for the purpose of permanent storage of those gases, including to facilitate and regulate the exploration for suitable underground geological storage formations, as part of Victoria’s commitment to the reduction of atmospheric greenhouse gas emissions.” The objectives of the Act are outlined in Section 7.",
                "year": 2008,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "link": "https://www.legislation.vic.gov.au/in-force/acts/greenhouse-gas-geological-sequestration-act-2008/013",
                "action_point": "Ensure the exploration permit holder conducts a work program to assess and establish the suitability and feasibility of underground geological formations for permanent greenhouse gas storage while protecting public health and the environment.",
                "summary": "- Understand that the exploration permit allows for greenhouse gas sequestration exploration and necessary activities in the permit area.\n- Recognize the right to apply for an injection and monitoring license or a sequestration formation retention lease upon discovering a suitable storage formation.\n- Ensure the work program establishes the characteristics and extent of geological storage formations.\n- Assess the feasibility and suitability of formations for permanent greenhouse gas storage.\n- Conduct exploration activities that protect the integrity of storage formations, public health, and the environment.\n- Achieve the work program's key objectives to the maximum practicable extent.\n- Note that the Victorian Onshore Act aims to facilitate and regulate greenhouse gas injection and storage as part of emission reduction efforts."
            },
            {
                "issue": "Site closure process",
                "regulation": "Greenhouse Gas Geological Sequestration Act 2008",
                "text": "**Site Closure Requirements**\n\nOnce CO2 injection activities are complete, **Section 92** requires the injection and monitoring licence holder to:\n1. Notify the Minister that injection activities have been completed.\n2. Plug or close off any wells.\n3. Remove all injection infrastructure.\n4. Rehabilitate the site.\n5. Surrender the right to inject CO2 under the relevant licence (although this surrender will be limited only to the right to inject CO2 and will not constitute a complete surrender of the licence).\n\nSimilar obligations apply under **Section 178** to holders of licences that are cancelled or expired.\n\n**Rehabilitation and Equipment Removal**\n\nUnder **Section 217**, any holder of a sequestration authority must rehabilitate the land used for operations. The Minister will then release the rehabilitation bond in accordance with **Section 223**. If the rehabilitation is incomplete or unsatisfactory, the Minister may conduct rehabilitation and recover costs under **Section 222**.\n\nOnce the authority ceases, **Section 228** requires the authority holder to remove all equipment within **sixty days**. If this is not done, **Section 229** allows the Minister to remove the equipment and recover costs.\n\n**Application for Site Closure Certificate**\n\nUnder **Section 414**, holders of greenhouse gas injection licences can apply for a site closure certificate, which requires submission of:\n1. Modeling of the injected greenhouse gas behavior.\n2. Assessment of the greenhouse gas movement and expected migration pathways.\n3. Short- and long-term migration consequences.\n4. Proposed monitoring approach post-closure.\n5. Additional information required by regulations.\n\n**Obligation to Apply for Site Closure Certificate**\n\nUnder **Section 415**, licence holders must apply for a site closure certificate within **thirty days** after ceasing injection. A similar obligation arises:\n1. **Section 416** – If the licence is subject to cancellation.\n2. **Section 418** – If a greenhouse gas injection licence is linked to a petroleum title that ceases to exist.\n\nIf the Minister is satisfied that injection has ceased or was never conducted, a **pre-certificate notice** may be issued under **Section 420**.\n\n**Grounds for Refusing a Site Closure Certificate**\n\nUnder **Section 422**, the Minister may refuse to issue a site closure certificate if:\n1. The injected greenhouse gas is not behaving as predicted.\n2. There is a significant risk to natural resources, geological integrity, environment, or human health.\n3. The statutory requirements have not been met.\n4. Any additional regulatory conditions remain unsatisfied.\n\n**Issuance of Site Closure Certificate**\n\nIf security requirements are met, **Section 427** mandates that the Minister issue a site closure certificate. Under **Section 429**, this certificate typically remains valid indefinitely.\n\n**Post-Closure Monitoring and Financial Security**\n\nUnder **Section 426**, pre-certificate notices must outline:\n1. A monitoring program for stored CO2 behavior.\n2. Estimated total costs for post-closure monitoring.\n3. Required security deposit (matching estimated monitoring costs).\n4. A sixty-day period to lodge the security deposit.\n\nIf the state incurs post-closure costs, **Section 433** allows it to recover expenses as a debt.\n\n**Ministerial Powers for Non-Compliance**\n\nIf an application is not made for a site closure certificate, or if obligations are not fulfilled, **Section 641** allows the Minister to issue a written direction requiring the licensee to:\n1. Remove property from the site.\n2. Plug or close off wells.\n3. Protect natural resources.\n4. Conduct necessary monitoring or remediation.\n5. Ensure injected greenhouse gas behaves as predicted.\n\nFailure to comply results in penalties. Under **Sections 644 and 645**, if a licensee fails to comply, the Minister may take necessary actions and recover costs through asset disposal.\n\n**Greenhouse Gas Geological Sequestration Act 2008 (Victorian Onshore Act)**\n\nThe purpose of the Victorian Onshore Act, as stated in **Section 1**, is to “facilitate and regulate the injection of greenhouse gas substances into underground geological formations for the purpose of permanent storage, including exploration for suitable storage formations, as part of Victoria’s commitment to reducing atmospheric greenhouse gas emissions.” The objectives of the Act are outlined in **Section 7**.",
                "year": 2008,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "link": "https://www.legislation.vic.gov.au/in-force/acts/greenhouse-gas-geological-sequestration-act-2008/013",
                "action_point": "Notify the Minister of completed CO2 injection, plug wells, remove infrastructure, rehabilitate the site, surrender injection rights, apply for a site closure certificate within 30 days, and ensure post-closure monitoring and financial security.",
                "summary": "- Notify the Minister once CO2 injection activities are complete as per Section 92.\n- Plug or close off any wells and remove all injection infrastructure according to Section 92.\n- Rehabilitate the site and surrender the right to inject CO2 under the relevant licence as required by Section 92.\n- Apply for a site closure certificate within thirty days after ceasing injection, as mandated by Section 415.\n- Ensure all equipment is removed within sixty days after authority ceases, per Section 228.\n- Submit required modeling and assessments for site closure certificate application under Section 414.\n- Monitor post-closure CO2 behavior and lodge a security deposit within sixty days, as outlined in Section 426.\n- Comply with Ministerial directions for non-compliance to avoid penalties, as stated in Section 641.\n- Be aware that the Minister may refuse a site closure certificate if statutory requirements are unmet or risks are identified, according to Section 422.\n- Understand that the Victorian Onshore Act aims to facilitate and regulate greenhouse gas injection for permanent storage, as per Section 1."
            },
            {
                "issue": "Site closure process",
                "regulation": "Class VI - Wells used for Geologic Sequestration of Carbon Dioxide",
                "text": "**Site Closure Requirements for Class VI Wells**\n\nAfter injection ceases at a **Class VI Geologic Sequestration (GS) project**, the injection well must be **plugged** to ensure it does not become a conduit for fluid movement into **Underground Sources of Drinking Water (USDWs)** (**40 CFR 146.92**). The required well plugging activities include:\n- Flushing the well with a buffer fluid.\n- Testing the **external mechanical integrity** of the well.\n- Emplacing **cement** into the well in a manner that prevents fluid movement that could endanger USDWs (**40 CFR 146.92(a) and (b)**).\n- Using materials compatible with the injectate (**40 CFR 146.92(b)(5)**).\n\nThis guidance document provides details on **mechanical integrity testing, plugging procedures, material selection, and placement methods** (**40 CFR 146.92(b)(4)-(6)**) but does not impose new legal requirements. It also provides guidance on **notices of intent to plug and plugging reports**. Operators are encouraged to follow similar procedures for plugging monitoring wells.\n\n**Post-Injection Site Care (PISC) and Site Closure Plan**\n\n- The **PISC phase** requires **continued monitoring** as specified in the UIC Program Director-approved **PISC and Site Closure Plan** (**40 CFR 146.93(a); 40 CFR 146.82(a)(17)**).\n- This monitoring ensures that USDWs remain protected and generally mirrors operational-phase monitoring but may **decrease in frequency**.\n- Changes to monitoring during PISC require **approved amendments** to the PISC and Site Closure Plan (**40 CFR 146.93(a)(4)**).\n- The default **PISC period is 50 years**, unless an alternative timeframe is approved based on site-specific data, modeling, and other evidence (**40 CFR 146.93(c)**).\n- Operators may apply for **early site closure** if they demonstrate **non-endangerment** of USDWs before the 50-year mark (**40 CFR 146.93(b)(2)**).\n\n**Process for Obtaining Site Closure Approval**\n\nTo obtain approval for site closure, operators must submit **non-endangerment evidence** to the UIC Program Director, demonstrating that the project no longer poses a risk to USDWs (**40 CFR 146.93(b)(3)**). If approved, the operator must:\n1. **Submit a notice of intent to close** at least **120 days prior to site closure** (**40 CFR 146.93(d)**).\n2. **Submit a site closure report** within **90 days after site closure** (**40 CFR 146.93(f)**), including:\n   - Well plugging records.\n   - Notifications to authorities.\n   - Records regarding the injectate.\n\nThe EPA provides guidance on compiling this information and meeting **Class VI requirements**. Examples in the guidance are illustrative and do not create additional regulatory obligations.\n\n**Underground Injection Control (UIC) Program**\n\nThe UIC program consists of **six classes of injection wells** based on the type and depth of injection, and their potential to endanger **Underground Sources of Drinking Water (USDWs)**:\n- **Class I** – Hazardous and non-hazardous waste injection into deep, isolated rock formations.\n- **Class II** – Injection related to oil and gas production.\n- **Class III** – Injection for mineral extraction.\n- **Class IV** – Injection of hazardous or radioactive waste into or above a USDW.\n- **Class V** – Non-hazardous fluid injection (e.g., wastewater disposal above USDWs).\n- **Class VI** – Injection of **carbon dioxide (CO2) for long-term geologic storage**.\n\nUIC regulations ensure that injection activities **do not endanger USDWs**. The UIC program may be administered by **EPA, states, territories, or tribes** with **EPA-approved permitting authority**. Activities include well permitting, monitoring, compliance inspections, and enforcement actions.\n\n",
                "year": 1980,
                "jurisdiction": "National",
                "status": "In force",
                "link": "https://www.epa.gov/sites/default/files/2016-12/documents/uic_program_class_vi_well_plugging_post-injection_site_care_and_site_closure_guidance.pdf",
                "action_point": "Plug the injection well, conduct mechanical integrity tests, and submit required notices and reports to ensure non-endangerment of USDWs and obtain site closure approval.",
                "summary": "- Ensure the injection well is plugged after injection ceases to prevent fluid movement into USDWs, as required by 40 CFR 146.92.\n- Conduct well plugging activities, including flushing with a buffer fluid, testing external mechanical integrity, and emplacing cement to prevent fluid movement, per 40 CFR 146.92(a) and (b).\n- Use materials compatible with the injectate, as specified in 40 CFR 146.92(b)(5).\n- Follow guidance on mechanical integrity testing, plugging procedures, material selection, and placement methods as outlined in 40 CFR 146.92(b)(4)-(6).\n- Continue monitoring during the PISC phase to protect USDWs, with potential decreased frequency, as per 40 CFR 146.93(a).\n- Obtain approved amendments for any changes to monitoring during PISC, according to 40 CFR 146.93(a)(4).\n- Default PISC period is 50 years unless an alternative is approved based on site-specific data, as stated in 40 CFR 146.93(c).\n- Apply for early site closure if non-endangerment of USDWs is demonstrated before the 50-year mark, as per 40 CFR 146.93(b)(2).\n- Submit non-endangerment evidence to the UIC Program Director for site closure approval, as required by 40 CFR 146.93(b)(3).\n- Submit a notice of intent to close at least 120 days prior to site closure, as mandated by 40 CFR 146.93(d).\n- Submit a site closure report within 90 days after site closure, including well plugging records and notifications, as specified in 40 CFR 146.93(f).\n- Understand that the UIC program regulates six classes of injection wells to protect USDWs, with Class VI specifically for CO2 geologic storage.\n- Recognize that the UIC program may be administered by EPA, states, territories, or tribes with EPA-approved authority, involving well permitting, monitoring, compliance inspections, and enforcement actions."
            }
        ]
    },
    {
        "region": "Western Australia (Australia)",
        "issues": [
            {
                "issue": "Long-term liability post-site closure",
                "regulation": "Barrow Island Act 2003",
                "text": "The Minister may, after the expiration of the 15-year period beginning on the CO2 injection cessation date, request the Commonwealth representative to confirm that: 1. The Gorgon CO2 injected into the formation is behaving as predicted in the plume modeling. 2. There is no significant risk of leakage. 3. There is no significant negative impact on geotechnical integrity, the environment, human health, and safety.\n\nThe State will indemnify the Joint Venturers for their common law liability to independent third parties arising after the liability assumption date for loss or damage caused by CO2 injection, provided such loss or damage is attributable to actions or omissions during CO2 injection operations under the disposal of carbon dioxide underground approval.\n\nThe Minister may disclose to the Commonwealth representative any information or documents related to CO2 injection operations, proposals by the Joint Venturers, or matters relevant to the Commonwealth representative’s satisfaction or the State’s indemnification liability.\n\nThe purpose of the Barrow Island Act 2003 is:\n- To ratify and implement an agreement between the State and the Gorgon Joint Venturers for offshore production of natural gas and petroleum, as well as a gas processing and infrastructure project on Barrow Island.\n- To ensure the agreement considers the need to minimize environmental disturbance on Barrow Island, a Class A nature reserve, and support conservation programs.\n- To allow up to 332 hectares of uncleared land on Barrow Island to be used for gas processing under the Land Administration Act 1997.\n- To regulate the conveyance and underground disposal of carbon dioxide recovered during gas processing on Barrow Island.",
                "year": 2003,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Request confirmation from the Commonwealth representative after 15 years post-CO2 injection cessation to ensure compliance with plume behavior, leakage risk, and impact assessments.",
                "summary": "- Confirm that the Gorgon CO2 behaves as predicted in plume modeling after a 15-year period post-injection cessation.\n- Ensure there is no significant risk of CO2 leakage post-injection.\n- Verify there is no significant negative impact on geotechnical integrity, the environment, human health, and safety post-injection.\n- Recognize that the State indemnifies Joint Venturers for common law liability to third parties for damages caused by CO2 injection, provided these are due to actions or omissions during approved operations.\n- Allow the Minister to disclose relevant CO2 injection operation information to the Commonwealth representative.\n- Understand the Barrow Island Act 2003 aims to ratify an agreement for offshore natural gas and petroleum production and gas processing on Barrow Island.\n- Ensure the agreement minimizes environmental disturbance on Barrow Island, a Class A nature reserve, and supports conservation programs.\n- Permit the use of up to 332 hectares of uncleared land on Barrow Island for gas processing under the Land Administration Act 1997.\n- Regulate the conveyance and underground disposal of CO2 recovered during gas processing on Barrow Island.",
                "link": ""
            }
        ]
    },
    {
        "region": "Wyoming (United States)",
        "issues": [
            {
                "issue": "Financial assurances of long-term site stewardship",
                "regulation": "HB 17",
                "text": "35-11-318. Geologic sequestration special revenue account\n\n(a) There is created the Wyoming geologic sequestration special revenue account. The account shall be administered by the director and all funds in the account shall be transmitted to the state treasurer for credit to the account and shall be invested by the state treasurer as authorized under W.S. 9-4-715(a), (d) and (e) in a manner to obtain the highest return possible consistent with the preservation of the corpus. Any interest earned on the investment or deposit of monies into the fund shall remain in the fund and shall not be credited to the general fund. All funds in the account are continuously appropriated for use by the director consistent with this section.\n\n(b) The account shall consist of all monies collected by the department to measure, monitor and verify Wyoming geologic sequestration sites following site closure certification, release of all financial assurance instruments and termination of the permit. The department shall promulgate rules necessary to collect monies in an amount reasonably calculated to pay the costs of measuring, monitoring and verifying the sites.\n\n(c) Funds in the account shall be used only for the measurement, monitoring and verification of geologic sequestration sites following site closure certification, release of all financial assurance instruments and termination of the permit.\n\n(d) The existence, management and expenditure of funds from this account shall not constitute a waiver by the state of Wyoming of its immunity from suit, nor does it constitute an assumption of any liability by the state for geologic sequestration sites or the carbon dioxide and associated constituents injected into those sites.\n\nHB 17\n\nThis bill directs the Department of Environmental Quality to specify insurance requirements for CO2 storage permits, establishes a CO2 storage fund for the costs associated with long-term storage site stewardship, and clarifies that the state does not automatically assume long-term liability of the closed storage site.",
                "year": 2010,
                "jurisdiction": "State/Provincial",
                "status": "In force",
                "action_point": "Establish and maintain a geologic sequestration special revenue account to fund the measurement, monitoring, and verification of sequestration sites post-closure.",
                "summary": "- Recognize the creation of the Wyoming geologic sequestration special revenue account for long-term site stewardship.\n- Ensure the account is administered by the director and funds are invested to maximize returns while preserving the corpus.\n- Note that interest earned remains in the fund and is not credited to the general fund.\n- Understand that funds are continuously appropriated for use by the director for site measurement, monitoring, and verification post-closure.\n- Collect monies to cover costs of measuring, monitoring, and verifying sites after closure certification, release of financial assurances, and permit termination.\n- Use funds exclusively for post-closure site measurement, monitoring, and verification.\n- Acknowledge that the existence and management of the fund do not waive Wyoming's immunity from suit or assume liability for sequestration sites.\n- Follow the Department of Environmental Quality's insurance requirements for CO2 storage permits.\n- Be aware that the state does not assume long-term liability for closed storage sites.",
                "link": "https://wyoleg.gov/2010/Enroll/HB0017.pdf"
            }
        ]
    }
]